{"conference":{"conference_name":"ETE2015","start_date":"2015-04-07","end_date":"2015-04-08","longitude":-75.143732,"latitude":39.946117,"image_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/ete2015.png","twitter_hashtag":"#phillyete","venue":"Society Hill Sheraton","venue_website":"http:\/\/www.starwoodhotels.com","venue_phone":"215-238-6000","street_address":"1 Dock Street","city":"Philadelphia","state":"PA","zip":"19106","tz_offset":300,"tz_abbr":"EDT","tz_name":"America\/New_York"},"speakers":[{"id":519,"first_name":"Jessica","last_name":"Kerr","bio":"<p>Jessica Kerr is a static-typing fan working in a dynamic language. <!--more--><\/p>\n<p>She writes Clojure full-time for Outpace, after a few years in Scala and a decade in Java. As time allows, she speaks about functional programming in the US and Europe, blogs, tweets, teaches for Pluralsight, and raises two daughters. Her side projects include measuring pain, categorizing yaks, and defining “quality.” <\/p>\n","position":"Functional developer on the JVM","twitter":"jessitron","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/jessica-kerr.jpg"},{"id":513,"first_name":"Don","last_name":"Coleman","bio":"<p>Don is a software developer who enjoys hacking with Phones, Arduino and other hardware. <!--more-->As the Director of Consulting for Chariot Solutions he works with teams and clients to reinvent their existing technology and lay the groundwork for the future. Don has embraced PhoneGap since it’s inception and has and has spoken across the country about the benefits and advantages of using Apache Cordova. Don is the co-author of <a href=\"http:\/\/shop.oreilly.com\/product\/0636920021193.do\"><em>Beginning NFC<\/em><\/a> and is currently working on a book about Bluetooth Low Energy for Maker Media.<\/p>\n","position":"Director of Consulting, Chariot Solutions","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/don-coleman.jpg"},{"id":509,"first_name":"Svetlana","last_name":"Isakova","bio":"<p>Svetlana is working on <a href=\"http:\/\/kotlinlang.org\/\">Project Kotlin<\/a> at JetBrains since 2011. From time to time she tries to encourage people with Kotlin at the conferences.<!--more--> She loves concepts and ideas, and skiing in the Alps, as well.<\/p>\n","position":"Kotlin Developer, JetBrains","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/svetlana-isakova.jpg"},{"id":494,"first_name":"Ken","last_name":"Rimple","bio":"<p>Ken almost started coding at an early age when he used a battery, two wires and an old flashcube to make a flashlight <!--more-->(those in the other room saw a blinding flash, then heard screams of agony). Dodging this early accident, he never stops learning how to break things. He is Chariot’s Training Services director, and writes and teaches lots of AngularJS courses. He also teaches\/works with Spring, Java and Maven, among others, and worked previously with Spring Roo (he’s co-author of <a href=\"http:\/\/www.manning.com\/rimple\/\">Spring Roo in Action<\/a> from Manning), Grails and various databases. He loves photography and Jazz Drumming, and lives alone with four kids, a wife, three dogs and his tinnitus.<\/p>\n","position":"AngularJS Trainer\/Mentor; Chariot Podcast Host","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/ken-rimple.jpg"},{"id":485,"first_name":"Duncan K.","last_name":"DeVore","bio":"<p>Duncan is an Akka Expert and Trainer @ Typesafe and is passionate about reactive application (distributed systems) design using tools such as Scala, Java, and Akka.<!--more--> He is co-author of the upcoming Reactive Application Development book from Manning, and when not coding, enjoys backpacking and the great outdoors.<\/p>\n","position":"Co-Author, Reactive Application Development","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/duncan-deVore.png"},{"id":479,"first_name":"Beth Bunting","last_name":"Arnholt","bio":"<p>Beth Bunting Arnholt serves as Vice President of Integrated Talent Management for Comcast\/NBCUniversal. <!--more-->In this role she partners across Comcast Corporate, Comcast Cable, and NBCUniversal on the design and implementation of world-class Talent strategies. She works closely with the Cable and NBCUniversal teams to build a culture that takes a future focused, enterprise wide view of talent as a key business driver.<\/p>\n<p>Beth joined Comcast from BDC Consulting where she served for five years as Principal and Owner, providing strategic human resources and organizational development counsel to a variety of companies including Comcast Cable, Conectiv Energy, Bayada Home Health Care, and The Golf Channel.  Prior to BDC Consulting, she held various roles at Comcast Cable, most recently serving as Vice President of Human Resources, and before that, Vice President of Recruiting and Career Development.<\/p>\n<p>Beth actively involved as a mentor for Comcast\/NBCUniversal’s Employee Resource Groups and Executive Leadership Forum.<\/p>\n","position":"VP, Integrated Talent Management, Comcast\/NBCUniversal","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/beth-bunting-arnholt-.jpg"},{"id":471,"first_name":"Kent C.","last_name":"Dodds","bio":"<p>Kent C. Dodds is the frontend developer at Alianza Inc where he works on their AngularJS Admin Portal. <!--more-->In Kent’s free time, he enjoys spending time with his wife and kids and coding (not normally at the same time). Kent is an instructor on the egghead.io training site and is involved in several open source projects and community efforts including AngularJS, angular-formly, Angular Air, various other open source efforts (see <a href=\"http:\/\/github.com\/kentcdodds\">github.com\/kentcdodds<\/a>), and speaking at conferences and local meetups about Angular, ReactJS, and general JavaScript topics. Kent enjoys talking with people about code and learning from others’ experiences. Find him on twitter @kentcdodds.<\/p>\n","position":"Egghead.io Instructor; Angular Air host; Angular Committer","twitter":"kentcdodds","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/kent-dodds.jpg"},{"id":465,"first_name":"David","last_name":"Richardson","bio":"<p>David Richardson has been optimizing distributed systems and analytics pipelines for the last 15 years. <!--more-->He has set several world records in scientific computing. He currently develops automated trading systems and analytics at <a href=\"http:\/\/www.sig.com\/\">SIG<\/a>, a proprietary trading firm located in Philadelphia.<\/p>\n","position":"Software Developer, SIG","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/david-richardson1.jpg"},{"id":457,"first_name":"Ritchie S.","last_name":"King","bio":"<p>Ritchie is a visual journalist at <a href=\"http:\/\/fivethirtyeight.com\">FiveThirtyEight<\/a>, meaning that he builds interactive data visualizations (mostly with D3), <!--more-->makes and edits charts for the site, and does some reporting and writing here and there. He also makes tools that other members of the newsroom can use to, say, create their own charts. Before FiveThirtyEight, he worked at Quartz, Bloomberg Businessweek, and The New York Times.<\/p>\n<p>Ritchie is the author of <a href=\"http:\/\/ritchiesking.com\/book\/\"><em>Visual Storytelling with D3<\/em><\/a>, a book that both introduces JavaScript’s excellent D3 library and touches on how to turn data into compelling visual stories. The book is part of Addison-Wesley’s Data & Analytics series.<\/p>\n","position":"author of Visual Storytelling with D3","twitter":"","web":"http:\/\/ritchiesking.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/ritchie-king.jpg"},{"id":446,"first_name":"Pete","last_name":"Hunt","bio":"<p>Pete is CEO and cofounder of Authbox, an anti-spam, abuse an fraud API.<!--more--> Before Authbox he was an engineering manager at Instagram and one of the original members of the React team at Facebook. Pete has an M.Eng in Computer Science from Cornell University, focused on distributed systems.<\/p>\n","position":"React core developer; Ex-Facebook and Instagram","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/pete-hunt.jpg"},{"id":430,"first_name":"Tom","last_name":"Igoe","bio":"<h2>Keynote Speaker<\/h2>\n<p>Tom Igoe is an Associate Arts Professor at NYU’s Interactive Telecommunications Program (ITP). <!--more--><\/p>\n<p>Coming from a background in theatre lighting design, Igoe makes tools that sense and respond to a wide range of human physical expression. He is the aread head for physical computing courses, and teaches courses in networking as well. He is also interested in how to lessen the impact that making things has on the environment, and how open hardware development can contribute to that. He has written four books for makers and he is an occasional contributor to Make magazine as well. He is a co-founder of Arduino, an open source microcontroller environment built for non-technicians. He has consulted for various museums and interactive design companies as well. He is currently living a personal dream of working with monkeys, and wants to visit Svalbard someday. Tom blogs at <a href=\"http:\/\/tigoe.net\/blog\">tigoe.net\/blog<\/a>.<\/p>\n","position":"Co-founder of Arduino","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/tom-igoe.jpg"},{"id":415,"first_name":"Diptanu","last_name":"Choudhury","bio":"<p>Diptanu is a Senior Platform Engineer at <a href=\"https:\/\/www.netflix.com\">Netflix<\/a>. He works on core infrastructure like distributed scheduling, core infrastructure libraries, service discovery, distributed tracing that powers various services at Netflix.<\/p>\n","position":"Senior Platform Engineer, Netflix","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/diptanu-choudhury.jpg"},{"id":413,"first_name":"Brian","last_name":"Clapper","bio":"<p>Brian Clapper is an independent consultant with more than 30 years’ experience as a software developer. Brian is fluent in many languages, including Scala, Java, Python, Ruby and C#, and C. <!--more--><\/p>\n<p>In addition, he is highly familiar with current web application technologies, including frameworks like Play!, Ruby on Rails, Django, and front-end technologies like Knockout.js and Angular.js. Brian founded the <a href=\"http:\/\/scala-phase.org\">Philly Area Scala Enthusiasts<\/a> in 2010 and, since 2011, has been a co-organizer of the <a href=\"http:\/\/www.nescala.org\">Northeast Scala Symposium<\/a>; he was also co-organizer of Scalathon, in 2011 and 2012.<\/p>\n","position":"Founder of PHASE and co-organizer, Northeast Scala Symposium","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/brian-clapper.jpg"},{"id":411,"first_name":"Diana","last_name":"Larsen","bio":"<p>Diana Larsen, founding partner of FutureWorks Consulting, is considered an international authority in the areas of Agile software development, team leadership, and Agile transitions. <!--more--><\/p>\n<p>Diana works with organizations around the world to design high performance work systems, improve project team effectiveness, and support leaders and enterprises in their transitions to Agile methods. Diana co-founded FutureWorks Consulting LLC and draws on 20+ years of working with technical professionals to coach managers on their role in a changing workplace.<\/p>\n<p>Deeply in tune with how work teams grow, adapt, develop, and perform, she co-authored <i>Agile Retrospectives: Making Good Teams Great<\/i>(recommended reading for the PMI-ACP); <i>Liftoff: Launching Agile Teams and Projects<\/i>; <i>Quickstart Guide to Five Rules for Accelerated Learning<\/i>; and articles about the Agile Fluency<sup>TM<\/sup><sup> <\/sup>model at <a href=\"http:\/\/www.agilefluency.com\/\">www.agilefluency.com<\/a> and <a href=\"http:\/\/www.infoq.com\/articles\/agile-fluency-fit-purpose\">http:\/\/www.infoq.com\/articles\/agile-fluency-fit-purpose<\/a>.<\/p>\n","position":"Agile Retrospectives: Making Good Teams Great, co-author","twitter":"DianaOfPortland","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/diana-larsen.jpg"},{"id":390,"first_name":"Dave","last_name":"Thomas","bio":"<h2>Keynote Speaker<\/h2>\n<p>Dave Thomas has been programming since the 70’s, and still codes just about every day. He has written a number of books, including The Pragmatic Programmer, Programming Ruby, Agile Web Development with Rails, and most recently Programming  Elixir. <!--more--><\/p>\n<p>These books reflect the arc of his interests — programming, dynamic languages, DSLs, and now functional and concurrent languages.<\/p>\n","position":"co-author of The Pragmatic Programmer","twitter":"pragdave","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/dave-thomas.jpg"},{"id":371,"first_name":"Valerie","last_name":"Thomas","bio":"<p>Valerie Thomas is a Principal Information Security Consultant for <a href=\"https:\/\/www.securicon.com\">Securicon, LLC<\/a> that specializes in social engineering and physical penetration testing. <!--more--><\/p>\n<p>After obtaining her bachelor’s degree in Electronic Engineering, Valerie led information security assessments for the Defense Information Systems Agency (DISA) before joining private industry. Valerie is the co-author of “<a href=\"http:\/\/www.amazon.com\/Building-Information-Security-Awareness-Program\/dp\/0124199674\">Building an Information Security Awareness Program: Defending Against Social Engineering and Technical Threats<\/a>” with Bill Gardner. Throughout her career, Valerie has conducted penetration tests, vulnerability assessments, compliance audits, and technical security training for executives, developers, and other security professionals.<\/p>\n","position":"co-author, Building an Informational Security Awareness Program","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/valerie-thomas.jpg"},{"id":366,"first_name":"Jamie","last_name":"Allen","bio":"<p>Jamie is the Senior Director of Global Services for Typesafe, responsible for the enablement of customers around the world through consulting and training. <!--more--><\/p>\n<p>He is the author of Effective Akka book from O’Reilly, and the co-author of the upcoming Reactive Design Patterns book from Manning. Jamie is a computer languages enthusiast who enjoys writing performant code that most efficiently leverages the resources at hand.<\/p>\n","position":"Author of Effective Akka","twitter":"jamie_allen","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/jamie-allen.jpg"},{"id":363,"first_name":"Michael","last_name":"Toppa","bio":"<p>Mike Toppa has been developing web applications for 18 years, since the days of the Mosaic browser and HTML 1.0. <!--more-->Prior to his current position as a software engineer at the Agile consulting company PromptWorks, Mike was half of the 2 person engineering team at the Philadelphia based start-up ElectNext. He’s also worked E-Trade, Ask Jeeves, Penn, Stanford, and Georgetown University. Mike has led the adoption of Agile practices at several organizations. When away from his computer, you will most likely find him embroiled in a nerf gun battle with his 2 young boys, or tearing down yet another wall in his house.<\/p>\n","position":"Software engineer at PromptWorks","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/michael-toppa.jpg"},{"id":362,"first_name":"Paul","last_name":"Butcher","bio":"<p>Paul is an author and technology startup veteran, currently providing consultancy for founders and investors. His most recent book is Seven Concurrency Models in Seven Weeks: When Threads Unravel.<\/p>\n","position":"author, Seven Concurrency Models in Seven Weeks: When Threads Unravel","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/paul-butcher.jpg"},{"id":361,"first_name":"Michael","last_name":"Pilquist","bio":"<p>Michael is the chief software architect at Combined Conditional Access Development, LLC., a joint venture between Comcast and ARRIS Group Inc.<!--more--> At CCAD, he is responsible for the design and development of control systems that manage tens of millions of cable system devices, including settop boxes and headend equipment. Michael’s interests include functional programming, static type systems, concurrency, and the Scala programming language.<\/p>\n","position":"Scodec, creator","twitter":"","web":""},{"id":355,"first_name":"Tom","last_name":"Devane","bio":"<p>Tom Devane is an author and a principal at WorkplaceDynamics LLC. <!--more-->He specializes in helping companies develop an organizational culture that amplifies their strategy AND leads to higher employee engagement and retention. Prior to focusing on the cultural aspects of organizational performance Tom was a programmer and system architect with Accenture. He is the author of <i>Integrating Lean Six Sigma and High-Performance Organizations <\/i>(Wiley & Sons, 2003), the co-author of <i>The Change Handbook<\/i> (Berrett-Koehler, 1999, 2007), and a contributing author to <i>Business-Driven Information Technology<\/i> (Stanford University Press, 2003). Tom holds BS and MS degrees in Finance from the University of Illinois.<\/p>\n","position":"Integrating Lean Six Sigma and High-Performance Organizations, author","twitter":"","web":""},{"id":354,"first_name":"Jan","last_name":"Machaček","bio":"<p class=\"profile-description\"><a href=\"mailto:jan@eigengo.com\">Jan Machacek<\/a> is a passionate technologist with hands-on experience with the practical aspects of software delivery (architecture, quality, CI, CD);<!--more--><\/p>\n<p> the project management approaches (applying the principles of agile project management); mentoring and motivating the engineering & business teams. He shares his expertise and passion for software as the editor of the Open Source Journal, regularly contributes to open source projects and speaks at conferences in the UK and abroad.Jan is the author of many <a href=\"http:\/\/www.eigengo.com\/#opensource\">open source projects<\/a> (various Typesafe Activators, Reactive Monitor, Akka Patterns, Akka Extras, Scalad, Specs2 Spring and others), books and articles.<\/p>\n<p class=\"profile-description\"><a href=\"mailto:jan@eigengo.com\">Jan<\/a> always wants to hear about interesting projects, events, hackathons, …! He’s keen to share his expertise at conferences, user groups, or simply over a drink or two. If you have something to suggest or share, get in touch!<\/p>\n","position":"CTO Cake Solutions","twitter":"","web":"http:\/\/www.eigengo.com\/#contact","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/jan-machacek.jpg"},{"id":348,"first_name":"Joanne","last_name":"Molesky","bio":"<p>Joanne Molesky is co-author of Lean Enterprise – How High Performance organizations Innovate at Scale, published by O’Reilly Press. <!--more-->As a principal associate for ThoughtWorks, she is part of the management team for the internal IT services, specializing in Governance, Risk and Compliance. She holds CISA and CRISC certification.<\/p>\n","position":"co-author of Lean Enterprise","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/joanne-molesky.jpg"},{"id":346,"first_name":"Erik","last_name":"Osheim","bio":"<p>Erik is one of the creators of Spire, a Typelevel project designed to support fast, generic, and precise numerical programming in Scala. <!--more-->He is a contributor to the Scala compiler and standard library, and uses Scala to push the limits of JVM performance and expressiveness. Erik works at Meetup, where he collects, processes, and analyzes data to learn how to more effectively create community.<\/p>\n","position":"co-creator of Spire","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/eirikr-asheim.jpg"},{"id":343,"first_name":"Maurice","last_name":"Naftalin","bio":"<p>Maurice Naftalin has worked in the software industry for four decades as developer, designer, manager, teacher and author. <!--more--><\/p>\n<p>He has used every release of Java, and has written books on two of them, most recently “<a href=\"http:\/\/www.amazon.com\/Mastering-Lambdas-Programming-Multicore-Oracle\/dp\/0071829628\">Mastering Lambdas: Java Programming in a Multicore World<\/a>”, for Oracle Press. He is a frequent presenter at conferences worldwide, including JavaOne; he was a JavaOne Rockstar in 2013. He is a Java Champion.<\/p>\n","position":"Mastering Lambdas: Java Programming in a Multicore World, author","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/maurice-naftalin.jpg"},{"id":340,"first_name":"Ash","last_name":"Furrow","bio":"<p>Ash Furrow is a Canadian iOS developer and author, currently working at Artsy. He has published four books, many apps, and is a contributor to the open source community.<\/p>\n","position":"Author and iOS engineer, Artsy","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/ash-furrow.jpg"},{"id":338,"first_name":"Brendan","last_name":"McAdams","bio":"<p>Having recently returned from several wilderness years of being an itinerant conference speaker, trainer, & consultant <!--more--><\/p>\n<p>for such fine companies as MongoDB & Typesafe, Brendan now writes Scala code for Netflix, building beautiful APIs with Scalatra & Swagger.<\/p>\n","position":"Partner Portal, Netflix","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/brendan-mcadams.jpg"},{"id":326,"first_name":"Mike","last_name":"Rappaport","bio":"<p>CEO and a founding member of Chariot Solutions, a leading Philadelphia area enterprise application and mobile development consulting firm.<!--more--><\/p>\n<p>Chariot Solutions provides cutting edge technical services for mid-size to large companies that embrace open source and other emerging technologies. Chariot has been recognized by its employees as the Philly.com Top Workplace in 2011 and 2013.<\/p>\n<p>Before forming Chariot Solutions, he was managing director of a software company, and advanced from software design and development to business development and operations and personnel management. He learned that smaller teams of only high-end, well-rounded software architects were much more effective than using larger teams of mixed-level developers, an approach he brought to Chariot Solutions.<\/p>\n<p>Mike is also the Chairman of Haydle.<\/p>\n<p> <\/p>\n","position":"CEO and Founder, Chariot Solutions","twitter":"","web":"chariotsolutions.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/mike-rapp.jpg"},{"id":324,"first_name":"Jeremy","last_name":"Saenz","bio":"<p>Jeremy AKA <a href=\"https:\/\/twitter.com\/codegangsta\">@codegangsta<\/a> is a fellow Gopher, author, speaker and screencaster. <!--more--><\/p>\n<p>You have probably heard about one of his open source projects like Martini, Negroni, Gin, CLI and others. Jeremy is also the voice behind <a href=\"http:\/\/GopherCasts.io\">GopherCasts.io<\/a> and loves teaching people about technology through his programming screencasts.<\/p>\n","position":"Martini and Negroni, creator; the voice behind GopherCasts.io.","twitter":"codegangsta","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/jeremy-saenz.jpg"},{"id":323,"first_name":"Brian","last_name":"Shirai","bio":"<p>Coming soon.<\/p>\n","position":"Rubinius, core team","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/brian_shirai.jpg"},{"id":315,"first_name":"Stuart","last_name":"Halloway","bio":"<p>@stuarthalloway is a founder and President of Cognitect and of Relevance. He is a Clojure committer, and a developer of the Datomic<br \/>\ndatabase.<!--more--><\/p>\n<p>Stuart has spoken at a variety of industry events, including StrangeLoop, Clojure\/conj, EuroClojure, ClojureWest, SpeakerConf, QCon, GOTO, OSCON, RailsConf, RubyConf, JavaOne, and NFJS.<\/p>\n<p>Stuart has written a number of books and technical articles. Of these, he is most proud of Programming Clojure.<\/p>\n","position":"Datomic team; Clojure committer","twitter":"stuarthalloway","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/stuart-halloway.jpg"},{"id":302,"first_name":"Haoyi","last_name":"Li","bio":"<p>Haoyi is a software engineer at <a href=\"https:\/\/www.dropbox.com\/\">Dropbox<\/a> who writes Python and Coffeescript while working on the web codebase. <!--more-->In his free time, he works on various projects in Scala, most recently the Scala.js compiler and ecosystem.<\/p>\n","position":"Scala.js, core contributor","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/haoyi-li.jpg"},{"id":300,"first_name":"Danielle","last_name":"Sucher","bio":"<p>Danielle Sucher is a software engineer at <a href=\"https:\/\/stripe.com\/\">Stripe<\/a>, where she works on data infrastructure and machine learning. <!--more-->When she was a kid, Danielle wanted to grow up to live in a library in a lighthouse and spend all her time learning and solving puzzles and creating things. Except for the lighthouse (so far), that’s pretty much what her grown-up life has become. She loves digging into the guts of software and building tools and toys, because it’s way easier than sitting still.<\/p>\n","position":"Software Engineer, Stripe","twitter":"DanielleSucher","web":"http:\/\/daniellesucher.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/danielle-sucher.jpg"},{"id":297,"first_name":"Dietrich","last_name":"Featherston","bio":"<p>Dietrich is an infrastructure engineer at GitHub focused on building systems to help understand how people work together. <!--more-->Previously he <a href=\"https:\/\/vimeo.com\/42902962\" rel=\"noreferrer\">built the historical backend<\/a> powering <a href=\"https:\/\/www.boundary.com\/\" rel=\"noreferrer\">Boundary<\/a> which ingests 10s of terabytes of metrics data daily while serving queries at interactive latencies.<\/p>\n<p>He has spent most of his career focused on time-series analytics but sometimes <a href=\"http:\/\/d2f.tumblr.com\/\" rel=\"noreferrer\">dabbles in generative artwork<\/a>. He enjoys long-winded discussions of cryptozoology and <a href=\"http:\/\/www.d2fn.com\/2013\/01\/28\/functional-specifications-for-infrastructure-engineers.html\" rel=\"noreferrer\">software engineering as a professional discipline<\/a>. Dietrich can be found on twitter and other places as <a href=\"http:\/\/twitter.com\/d2fn\" rel=\"noreferrer\">@d2fn<\/a>.<\/p>\n","position":"GitHub Analytics Infrastructure","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/dietrich-featherston.jpg"},{"id":290,"first_name":"Chris","last_name":"Richardson","bio":"<p>Chris Richardson is a developer and architect. He is a Java Champion and the author of POJOs in Action, <!--more-->which describes how to build enterprise Java applications with frameworks such as Spring and Hibernate. Chris was also the founder of the original <a href=\"http:\/\/cloudfoundry.com\/\"><span class=\"s1\">CloudFoundry.com<\/span><\/a>, an early Java PaaS for Amazon EC2. He consults with organizations to improve how they develop and deploy applications and is working on his third startup.<\/p>\n","position":"Java Champion and Author of POJOs in Action","twitter":"crichardson","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/chris-richardson.jpg"},{"id":287,"first_name":"Todd","last_name":"Montgomery","bio":"<p>Todd Montgomery is a networking hacker who has researched, designed, and built numerous protocols, messaging-oriented middleware systems, <!--more-->and real-time data systems, done research for NASA, contributed to the IETF and IEEE, co-founded two startups, and contributes to a number of open source projects.<\/p>\n<p>He currently works for <a href=\"http:\/\/kaazing.com\">Kaazing<\/a> as Chief Architect.<\/p>\n","position":"Chief architect, Kaazing","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/todd-montgomery.jpg"},{"id":285,"first_name":"Sylvester","last_name":"Mobley","bio":"<p>Sylvester Mobley is the founder and executive director of Coded by Kids – an organization that provides free weekly web development classes to inner city children. <!--more-->The organization’s project based curriculum helps children as young as five years old gain real world development skills.<\/p>\n<p>Sylvester has extensive tech industry experience, which includes web design and development, technical project management, IT engagement management and launching startups.<\/p>\n<p>Sylvester is also a veteran of the war in Iraq, who gained his initial IT experience while serving in the United States military.<\/p>\n","position":"Founder of Coded by Kids","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/sylvester-mobley.jpg"},{"id":282,"first_name":"Kelsey","last_name":"Hightower","bio":"<p>Kelsey has worn every hat possible throughout his career in tech and enjoys leadership roles focused on making things happen and shipping software.<!--more--><\/p>\n<p>Kelsey is a strong open source advocate focused on building simple tools that make people smile. When he is not slinging Go code, you can catch him giving technical workshops covering everything from Programming, System Administration, and his favorite Linux distro (CoreOS).<\/p>\n","position":"CoreOS, Software Engineer","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/kelsey-hightower.jpg"},{"id":273,"first_name":"Christopher","last_name":"Wink","bio":"<p>Christopher Wink is the cofounder and editor of <a href=\"http:\/\/technical.ly\/\"><strong>Technical.ly<\/strong><\/a>, a network of local technology news sites and events,<!--more--> featuring its flagship <a href=\"http:\/\/www.technicallyphilly.com\/\" target=\"_blank\">Technically Philly<\/a> and sister publications in Brooklyn, Washington D.C., Baltimore and Delaware. In that capacity, he is a lead organizer of <a href=\"http:\/\/www.phillytechweek.com\/\" target=\"_blank\">Philly Tech Week<\/a> and Baltimore Innovation Week, among other events that bring smart people together. Previously, he worked for a homeless advocacy nonprofit and was a freelance reporter. He writes frequently about media and entrepreneurship on his personal blog at <a href=\"http:\/\/christopherwink.com\/\">christopherwink.com<\/a> and tweets<a href=\"http:\/\/twitter.com\/christopherwink\">@christopherwink<\/a>. The Temple University alumnus is a bicycle commuter and resident of the Fishtown neighborhood of Philadelphia<\/p>\n<p> <\/p>\n","position":"Cofounder and editor of Technical.ly","twitter":"christopherwink","web":"christopherwink.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/christopher-wink.jpg"},{"id":271,"first_name":"Ben","last_name":"Hindman","bio":"<p>Benjamin Hindman is a Founder of Mesosphere and co-creator of the Apache Mesos project. <!--more--><\/p>\n<p>Ben was a a PhD student at UC Berkeley before bringing Mesos to Twitter where it now runs on tens of thousands of machines powering Twitter’s datacenters. An academic at heart, his research in programming languages and distributed systems has been published in leading academic conferences.<\/p>\n","position":"Apache Mesos, co-creator","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/benjamin-hindman.jpg"},{"id":270,"first_name":"Ben","last_name":"Christensen","bio":"<p>Ben Christensen is a software engineer on the Netflix Edge Engineering team responsible for communication between Netflix devices and its cloud services.<!--more--> Recently involved in open source projects such as <a href=\"https:\/\/github.com\/Netflix\/Hystrix\">Hystrix<\/a> and <a href=\"https:\/\/github.com\/ReactiveX\/RxJava\">RxJava<\/a>.<\/p>\n","position":"RxJava team, Netflix","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/ben-christensen.jpg"},{"id":263,"first_name":"Tom","last_name":"Dale","bio":"<p>Tom is one of the creators of <a href=\"http:\/\/emberjs.com\">Ember.js<\/a>, and Co-founder at <a href=\"http:\/\/www.tilde.io\">Tilde Inc<\/a>. <!--more-->He spends his days working on the open source projects Tilde supports, and their first developer product, Skylight. He’s a former Apple engineer who first gained expert front-end JavaScript skills working on MobileMe and iCloud. He’s a super hipster, and still isn’t sure if it’s serious or ironic.<\/p>\n","position":"Co-creator, Ember.js","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/tom-dale.jpg"},{"id":262,"first_name":"Rebecca","last_name":"Wirfs-Brock","bio":"<p>Rebecca is an object design pioneer who invented the set of design practices known as Responsibility-Driven Design (RDD) and by accident started the x-Driven Design meme. <!--more-->Along the way she authored two popular object design books that are still in print.<\/p>\n<p>In her work, Rebecca’s helps teams hone their design and architecture skills, manage and reduce technical debt, refactor their code, and address architecture risks. In addition to coaching and personal mentoring, she teaches and conducts workshops on Responsibility-Driven Design, Pragmatic TDD, enterprise application design, agile design skills and thinking, being agile about system qualities, and Agile Architecture. In her spare time she jogs (even in the rain).<\/p>\n<p>Rebecca is also program director of the <a href=\"http:\/\/www.agilealliance.org\/programs\/experience-report-program\/\">Agile Alliance’s Experience Reports Program<\/a> and co-chair of the 2015 Agile Conference Experience Reports Track. Another interest of hers is software patterns. She serves on the Board of the Hillside Group and recently has written patterns about sustainable architecture, agile QA, and adaptive systems architectures. If you are interested in writing about your experiences or sharing your wisdom in pattern form, contact Rebecca. She can help you turn your itch for writing into the written word.<\/p>\n","position":"Object Design Pioneer","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/rebecca-wirfs-brock1.jpg"},{"id":260,"first_name":"Helena","last_name":"Edelson","bio":"<p>Helena is a committer on several open source projects including Akka (Akka Cluster), Apache Spark, the Spark Cassandra Connector, Spring Integration and Spring AMQP. <!--more-->She has been a Senior Software Engineer, Senior Cloud Engineer, Principal Engineer and Architect over the last 15 years. Her primary academic background is in science, specifically biology, where her studies of energy pathways in large-scale dynamic systems and biological system modeling led her to tech. For the last several Helena has been working in big data in the domains of cyber security and technology, and in Scala for 6 years. She is currently a Senior Engineer on the Analytics team at DataStax, working with Apache Spark, Cassandra, Kafka, Scala and Akka. Most recently she has been a speaker at international Big Data and Scala conferences including Strata, Spark Summit, Scala Days and Code Neuro.<\/p>\n","position":"Senior Engineer, Analytics @ DataStax; Spark Cassandra Connector committer","twitter":"helenaedelson","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/helena-edelson.jpg"},{"id":258,"first_name":"Colin","last_name":"Eberhardt","bio":"<p>Colin Eberhardt is Head of Technology at <a href=\"http:\/\/www.scottlogic.com\">Scott Logic Ltd<\/a>, where he provides advice on mobile technology strategy to major banks and financial institution. <!--more-->He is also CTO at <a href=\"http:\/\/www.shinobicontrols.com\">ShinobiControls<\/a>, who provide a range of high performance UI controls for iOS and Android. Colin is a prolific technical author, blogger and speaker on a diverse range of topics including Swift, ReactiveCocoa and HTML5.<\/p>\n","position":"Head of Technology, Scott Logic Ltd.","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/colin-eberhardt.jpg"},{"id":256,"first_name":"Aaron","last_name":"Bedra","bio":"<p>Coming soon.<\/p>\n","position":"Principle Engineer, Groupon. Creator of Repsheet ","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/aaron-bedra.jpg"},{"id":249,"first_name":"Mike","last_name":"Hartington","bio":"<p>Mike is a developer advocate for Ionic who has been involved with the product since the early alpha. <!--more--><\/p>\n<p>Mike manages the Ionic Forum, serves as a resource to developers, and writes technical documentation. When he’s not working, you can find him relaxing with a beer and a guitar.<\/p>\n","position":"Ionic, Developer Advocate","twitter":"mhartington","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/mike-hartington.jpg"},{"id":240,"first_name":"Ron","last_name":"Jeffries","bio":"<p>Ron Jeffries has been developing software longer than most people have been alive. <!--more-->He holds advanced degrees in mathematics and computer science, both earned before negative integers had been invented. His teams have built operating systems, compilers, relational database systems, and a large range of applications. Ron’s software products have produced revenue of over half a billion dollars, and he wonders why he didn’t get any of it.<\/p>\n<p>Ron is an author of the Agile Manifesto, having been part of the Agile movement before it was even named Agile. His web site <a href=\"http:\/\/www.xprogramming.com\/\" target=\"_blank\">www.XProgramming.com<\/a> is in the process of moving to <a href=\"http:\/\/ronjeffries.com\/\">ronjeffries.com<\/a>, where his newest writings will be found, as well as all the material from the XProgramming site.<\/p>\n<p>Ron’s most recent book, <a href=\"https:\/\/pragprog.com\/book\/rjnsd\/the-nature-of-software-development\"><i>The Nature of Software Development<\/i><\/a>, was released in December 2014 by Pragmatic Programmers.<\/p>\n","position":"Agile Manifesto co-author","twitter":"","web":"www.ronjeffries.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/ron-jeffries.jpg"},{"id":238,"first_name":"Chet","last_name":"Hendrickson","bio":"<p>Chet Hendrickson has been involved with Agile Software Development since 1996, when as a member of Chrysler’s C3 project he helped develop Extreme Programming. <!--more--><\/p>\n<p>In 2000, Ron Jeffries, Ann Anderson, and Chet wrote <em><strong><a href=\"http:\/\/www.amazon.com\/Extreme-Programming-Installed-Ron-Jeffries\/dp\/0201708426\">Extreme Programming Installed<\/a><\/strong><\/em>. It detailed XP’s core practices, how to do them, and how they work together to help teams be successful.<\/p>\n<p>Since 2002, Chet has been an independent consultant, coach, and trainer. In 2009, he was asked by the Scrum Alliance to help develop the Certified Scrum Developer program. Chet and Ron Jeffries taught the first CSD course and continue to offer them in the United States and Europe. He has been a Certified Scrum Trainer since 2009.<\/p>\n<p>Chet and Ron Jeffries often work together and are popular conference speakers, bringing an interesting mix of humor and deep knowledge, and the odd cat picture.<\/p>\n","position":"Agile Manifesto co-author","twitter":"","web":"hendricksonxp.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/chet-hendrickson.jpg"},{"id":232,"first_name":"Seth","last_name":"Vargo","bio":"<p>Seth Vargo is an engineer and evangelist at HashiCorp. As an engineer, he works on a variety of open source projects and commercial offerings. <!--more--><\/p>\n<p>As an evangelist, he presents at meetups and conferences. Seth is very active in the DevOps community, helping to organize events such as DevOpsDays Pittsburgh as well as being a contributor to popular community projects. He is an O’Reilly Author, teacher, and lover of all things computers.<\/p>\n","position":"Vagrant, committer; Learning Chef, co-author","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/seth-vargo.jpg"},{"id":198,"first_name":"Rick","last_name":"Nucci","bio":"<p>Rick has been an entrepreneur in the Philadelphia area since 1999. Rick is currently the co-founder & CEO of <a title=\"Guru\" href=\"http:\/\/www.guru.com\">Guru<\/a>, which provides knowledge sharing for teams. <!--more-->Based on a new concept known as Ambient Knowledge, Guru is built into apps such as email, allowing teams to access trusted knowledge to share with their customers all in one place.<\/p>\n<p>Prior to Guru Rick was the Founder and CTO of Boomi, which defined and led a new segment as the industry’s first cloud integration platform-as-a-service. Boomi was acquired by Dell in 2010, where Rick went on to run the Boomi business for Dell, helping grow the organization into the industry leader it is today.<\/p>\n<p>Rick is currently the president of Philly Startup Leaders, one of the most active entrepreneur groups in Philadelphia. He also frequently speaks at industry events on topics of entrepreneurship, API’s and cloud computing.<\/p>\n","position":"co-founder & CEO, Guru","twitter":"ricknucci","web":"www.guru.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/rick-nucci.jpg"},{"id":190,"first_name":"Monica","last_name":"Beckwith","bio":"<p>Monica Beckwith is a Java Performance Consultant. She was the Java Garbage First Garbage Collector Performance Lead at Oracle. <!--more-->Her past experiences include working with Oracle\/Sun and AMD optimizing the JVM for server class systems.  Monica was voted a Rock Star speaker @JavaOne 2013. You can follow Monica on twitter @mon_beck.<\/p>\n","position":"Java\/JVM Performance Consultant, JavaOne 2013 Rock Star","twitter":"mon_beck","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/monica-beckwith.jpg"},{"id":183,"first_name":"Soumith","last_name":"Chintala","bio":"<p>I am a Research Engineer at Facebook AI Research. Prior to joining Facebook in August 2014, I worked at MuseAmi, where I built deep learning models for music and vision targeted at mobile devices. <!--more-->I hold a Masters in CS from NYU, and spent time in Yann’s lab building deep learning models for pedestrian detection, natural image OCR, depth-images among others.<\/p>\n","position":"Research Engineer, Facebook AI Research","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/soumith-chintala.jpg"},{"id":182,"first_name":"Jay","last_name":"Kreps","bio":"<p>Jay is the CEO of <a href=\"http:\/\/confluent.io\">Confluent<\/a>, a company focused on building a real-time stream platform around Apache Kafka.<!--more--><\/p>\n<p>Previously, he was one of the primary architects for LinkedIn where he focused on data infrastructure and data-driven products.<\/p>\n<p>He was among the original authors of a number of open source projects in the big data space, including Voldemort, Kafka, and Samza.<\/p>\n","position":"original author of Apache Kafka, Apache Samza, and Voldemort","twitter":"jaykreps","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/jay-kreps.jpg"},{"id":180,"first_name":"Yehuda","last_name":"Katz","bio":"<p>Yehuda Katz is a member of the <a style=\"color: #3b73af;\" href=\"http:\/\/www.sproutcore.com\/\" target=\"_blank\" rel=\"nofollow\"> <\/a><a style=\"color: #3b73af;\" href=\"http:\/\/www.sproutcore.com\/\" target=\"_blank\" rel=\"nofollow\">E<\/a><a style=\"color: #3b73af;\" href=\"http:\/\/www.emberjs.com\/\" target=\"_blank\" rel=\"nofollow\">mber.js<\/a>, <a style=\"color: #3b73af;\" href=\"http:\/\/www.rubyonrails.org\/\" target=\"_blank\" rel=\"nofollow\">Ruby on Rails<\/a> and <a style=\"color: #3b73af;\" href=\"http:\/\/www.jquery.com\/\" target=\"_blank\" rel=\"nofollow\">jQuery<\/a> Core Teams; his 9-to-5 home is at the startup he founded, <a style=\"color: #3b73af;\" href=\"http:\/\/www.tilde.io\/\" target=\"_blank\" rel=\"nofollow\">Tilde Inc.<\/a>. <!--more-->There he works on <a style=\"color: #3b73af;\" href=\"http:\/\/www.skylight.i\/\" target=\"_blank\" rel=\"nofollow\">Skylight<\/a>, the smart profiler for Rails, and does <a style=\"color: #3b73af;\" href=\"http:\/\/www.tilde.io\/ember-consulting\/\" target=\"_blank\" rel=\"nofollow\">Ember.js consulting<\/a>.<\/p>\n<p>He’s best known for his open source work, which also includes projects like <a style=\"color: #3b73af;\" href=\"https:\/\/github.com\/wycats\/thor\" target=\"_blank\" rel=\"nofollow\">Thor<\/a>, <a style=\"color: #3b73af;\" href=\"http:\/\/www.handlebarsjs.com\/\" target=\"_blank\" rel=\"nofollow\">Handlebars<\/a> and <a style=\"color: #3b73af;\" href=\"https:\/\/github.com\/carlhuda\/janus\" target=\"_blank\" rel=\"nofollow\">Janus<\/a>. He travels the world doing open source evangelism and web standards work. He blogs at <a style=\"color: #3b73af;\" href=\"http:\/\/yehudakatz.com\/\" target=\"_blank\" rel=\"nofollow\">http:\/\/yehudakatz.com<\/a> and can be found on Twitter as <a style=\"color: #3b73af;\" href=\"http:\/\/www.twitter.com\/wycats\" target=\"_blank\" rel=\"nofollow\">@wycats<\/a>.<\/p>\n","position":"Co-creator, Ember.js","twitter":"wycats","web":"yehudakatz.com","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/yehuda-katz.jpg"},{"id":178,"first_name":"Caryl","last_name":"Rivers","bio":"<p>Caryl Rivers and Rosalind C. Barnett have received wide critical praise for their books about women, men, work and society. <!--more-->Their book, The New Soft War on Women (Tarcher\/ Penguin, 2013, was an Oprah magazine Top Ten pick. The Boston Globe said, “Rivers and Barnett, who have co-authored three previous books on gender and economics, deploy both hard numbers and human stories to make a powerful case that, despite current myths of female ascendance and male decline, when women make careers they have to do so while “carrying a history of gender discrimination that is as heavy as a pack filled with large rocks.”<\/p>\n<ul>\n<li>In 2011 they won both the Casey Medal for distinguished journalism and a special citation from the National Education Writers Association for opinion columns.<\/li>\n<li>The Editorial Board of the Boston Globe voted their book “Same Difference” one of the best books of the year in 2004.<\/li>\n<li>The New York Times called their book She Works, He Works a bold new framing of the story of the American family, and praised its lucid prose.<\/li>\n<li>The Sloan Foundation designated their book “Lifeprints” as a “classic book” from the work-family canon that has made “a significant contribution and stood the test of time.” (The book was funded by a grant from the National Science Foundation.)<\/li>\n<\/ul>\n<p>Caryl Rivers is a nationally known author and journalist. She was awarded the Helen Thomas Lifetime Achievement Award in 2007 from the Society of Professional Journalists for distinguished achievement in Journalism She is professor of Journalism at Boston University.<\/p>\n","position":"Author and Journalist","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/caryl-rivers.jpg"},{"id":177,"first_name":"Rosalind Chait","last_name":"Barnett","bio":"<p>Caryl Rivers and Rosalind C. Barnett have received wide critical praise for their books about women, men, work and society. <!--more-->Their book, The New Soft War on Women (Tarcher\/ Penguin, 2013, was an Oprah magazine Top Ten pick. The Boston Globe said, “Rivers and Barnett, who have co-authored three previous books on gender and economics, deploy both hard numbers and human stories to make a powerful case that, despite current myths of female ascendance and male decline, when women make careers they have to do so while “carrying a history of gender discrimination that is as heavy as a pack filled with large rocks.”<\/p>\n<ul>\n<li>In 2011 they won both the Casey Medal for distinguished journalism and a special citation from the National Education Writers Association for opinion columns.<\/li>\n<li>The Editorial Board of the Boston Globe voted their book “Same Difference” one of the best books of the year in 2004.<\/li>\n<li>The New York Times called their book She Works, He Works a bold new framing of the story of the American family, and praised its lucid prose.<\/li>\n<li>The Sloan Foundation designated their book “Lifeprints” as a “classic book” from the work-family canon that has made “a significant contribution and stood the test of time.” (The book was funded by a grant from the National Science Foundation.)<\/li>\n<\/ul>\n<p>Rosalind Chait Barnett’s pioneering research on workplace issues and family life in America has been sponsored by major federal grants She is senior scientist at the Women’s Studies Research Center at Brandeis University.<\/p>\n","position":"Senior Scientist, Brandeis University","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/rosalind-barnett.jpg"},{"id":176,"first_name":"Charles","last_name":"Eaton","bio":"<p>Charles Eaton is CEO of the Creating IT Futures Foundation, the charitable arm of CompTIA, the IT industry association. <!--more-->Focused on inventing better on-ramps to IT careers, the foundation’s services help populations that are under-represented in IT and individuals who are lacking in opportunity prepare for, secure and be successful in IT careers.<\/p>\n<p>Mr. Eaton joined CompTIA in June 2010 and has 20 years of non-profit management experience. Prior to joining CompTIA, he was responsible for fundraising, business development and marketing for the Association for Professionals in Infection Control and Epidemiology (APIC), a growing healthcare association focused on improving healthcare quality and patient safety. Before joining APIC, Mr. Eaton was vice president of member relations for the Consumer Electronics Association (CEA), which organizes the largest tradeshow in North America, the International Consumer Electronics Show (CES) in Las Vegas.<\/p>\n<p>Mr. Eaton graduated with a Bachelor of Arts in English from Duke University and has four kids, who have all been forced to love Duke basketball.<\/p>\n","position":"CEO, Creating IT Futures Foundation","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/charles-eaton.jpg"},{"id":172,"first_name":"Kunal","last_name":"Batra","bio":"<p>Meet Kunal, Developer Evangelist at-large for <a href=\"https:\/\/sendgrid.com\">SendGrid<\/a> and home-grown New Jersey hacker. <!--more-->He previously ran General Machines, which developed Deaftel – a phone service for the deaf that converts voice to text and text back into voice over a phone call. Since March 2013, Kunal has been working as a Developer Evangelist at SendGrid, helping enable developers to get the tools and resources they need to make awesome, creative stuff.<\/p>\n","position":"Developer Evangelist, SendGrid","twitter":"SendGrid","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/kunal-batra.jpg"},{"id":147,"first_name":"Tracey","last_name":"Welson-Rossman","bio":"<p>Founding Member and Chief Marketing Officer at Chariot Solutions, where she leads marketing and sales. <!--more-->Tracey is a recognized advocate for girls and women in tech and is the Founder of TechGirlz, a non-profit organization dedicated to inspiring teenage girls to consider careers in technology. She is also a strong presence in the Philly tech community as a Founding Board Member of Philadelphia Startup Leaders.<\/p>\n<p>She is co-chair of Emerging Technologies for the Enterprise and founder of the Women in Tech Summit, now in its’ fourth year.<\/p>\n<p>She is currently an advisor for the startups Haydle and ROAR.<\/p>\n","position":"CMO, Chariot Solutions & Founder, TechGirlz.org","twitter":"twelsonrossman","web":"techgirlz.org","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/tracey-rossman.jpg"},{"id":142,"first_name":"Allen","last_name":"Wirfs-Brock","bio":"<p>Allen Wirfs-Brock is a Mozilla Research Fellow and the technical editor of ECMA-262, the international standard that defines the JavaScript programming language. <!--more-->He is an expert in dynamic, object-oriented programming languages and their implementation but is also an entrepreneur who founded two successful companies. When he’s not working on the evolution of JavaScript, he is thinking and writing about the technical and societal implications of the rapidly emerging Ambient Computing Era.<\/p>\n","position":"ECMAScript 6 language spec project editor","twitter":"","web":"","picture_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/allen-wirfs-brock.jpg"}],"sessions":[{"id":526,"description":"<p>If things go to plan, Dave Thomas will contend that we are looking at emerging technology wrongly. By definition, newer will be worse than older, at least in the short term. And yet we jump like lemmings off the bright and shiny cliff. So how do we find a balance?<\/p>\n<p>Of course, things never go to plan.<\/p>\n","name":"Emerge-ncy","start_time":"2015-04-08T08:45:00-04:00","end_time":"2015-04-08T09:45:00-04:00","duration":3600,"session_location_name":"Grand Ballroom","session_track_name":"Keynote","speaker_ids":[390],"sponsor_id":null},{"id":525,"description":"<p>The internet has moved a long way beyond the command line. Nowdays, it connects everything from our cars to our toothbrushes, door locks, and keychains. It’s no longer possible to think about software without considering the hardware on which it runs, the sensors and actuators that are its nerves and muscles, the form in which it’s encased, and the physical behaviors of the people and devices involved. Open source hardware and digital fabrication tools are enabling a wider audience to engage in building all aspects of interactive technologies, regardless of their backgrounds.<\/p>\n<p>In this talk, I’ll present an overview of some of the tools of physical computing and discuss how and by whom they’re being used to create new connected devices.<\/p>\n","name":"Physical Computing, or How Software Meets Christmas Trees (and more)","start_time":"2015-04-07T08:45:00-04:00","end_time":"2015-04-07T09:45:00-04:00","duration":3600,"session_location_name":"Grand Ballroom","session_track_name":"Keynote","speaker_ids":[430],"sponsor_id":null},{"id":523,"description":"<p>Bluetooth Smart, or Bluetooth Low Energy devices are everywhere. We’ll look at how to discover, connect to, and control these devices with software. You’ll learn how Bluetooth LE works and understand profiles, services, and characteristics. I’ll demonstrate writing Android and iOS Bluetooth apps using Apache Cordova.<\/p>\n","name":"Creating Bluetooth Low Energy Apps","start_time":"2015-04-07T11:30:00-04:00","end_time":"2015-04-07T12:30:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Mobile","speaker_ids":[513],"sponsor_id":null},{"id":520,"description":"<p>Clojure makes highly functional programming fun… until it isn’t. Runtime type errors from a function that was returned from another function? I’m longing for Scala’s compiler errors! Nested maps of data make testing easier… until “Wait, what’s in there again?” What I want is a little bit of typing in strategic places: enter Prismatic’s Schema library. What look like types are really contracts. They’re even more powerful than types: they verify values as well as shapes. Exercised in generative tests, these contracts satisfy my type cravings without the pain of satisfying a compiler. There are limitations; schemas can’t express relationships between input and output types… or can they? Schemas don’t express parameterized types… or can they? Explore the potential of contracts as the best-yet compromise between types and tests. No Clojure experience (or interest) needed.<\/p>\n","name":"Contracts and Clojure: The Best-Yet Compromise Between Types and Tests","start_time":"2015-04-07T10:15:00-04:00","end_time":"2015-04-07T11:15:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Languages","speaker_ids":[519],"sponsor_id":null},{"id":517,"description":"<p>If you’re interested in visualizing data on the Internet, the best way<br \/>\nto do it is to use the JavaScript library, D3. Short for data-driven<br \/>\ndocuments, D3 works by marrying your data to your web page, a glorious<br \/>\nunion that enables you to sculpt that web page into a graphical<br \/>\ndisplay which mirrors exactly the structure of your data.<\/p>\n<p>Uh, so what does that mean, exactly? My goal is to answer that<br \/>\nquestion in this talk. I’ll go over some of D3’s core concepts and<br \/>\nshow, by way of an example graphic, how D3 can take raw information,<br \/>\nadd structure to it, and create, as if by magic, an endless number of<br \/>\nendlessly customizable chart forms. The talk will be largely<br \/>\nconceptual; you won’t walk away from it with any usable snippets of<br \/>\ncode. What you will gain, I hope, is an appreciation of D3’s power and<br \/>\nthe underlying logic that supplies it. I’ll also direct you to some<br \/>\ngood resources for getting started with D3 and give you some tips on<br \/>\navoiding the traps that beginners tend to fall into.<\/p>\n","name":"Visual Storytelling With D3: A Conceptual Introduction to Visualizing Data with JavaScript","start_time":"2015-04-07T14:45:00-04:00","end_time":"2015-04-07T15:45:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Frameworks","speaker_ids":[457],"sponsor_id":null},{"id":510,"description":"<p>Apple has introduced “a better language” for iOS developers. But what options do we have for Android? Surely Kotlin should be under consideration! Android Studio is now based on Intellij Idea, the “native” environment for Kotlin.<\/p>\n<p>Kotlin is a modern language for industry. It can help you reduce the amount of code you write for Android applications and at the same time make it readable and more maintainable.<\/p>\n<p>In this session we are going to talk a bit why JetBrains sees the potential in Kotlin comparing to other JVM languages. Then we’ll see how certain language constructs can be used to make Android more enjoyable. Also we’ll look at a DSL for type-safe dynamic layouts and a simple extension plugin that helps to avoid writing ‘findViewById()’ all the time.<\/p>\n","name":"Kotlin on Android","start_time":"2015-04-07T10:15:00-04:00","end_time":"2015-04-07T11:15:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Mobile","speaker_ids":[509],"sponsor_id":null},{"id":508,"description":"<p>In order to understand something, whether it be user behavior or software infrastructure, we must understand how it moves and changes with time. Unfortunately most of the tools of our trade offer little help in this regard. Packet switchers move data through our networks and relational databases hold onto account information. But what helps us understand the nature of this network traffic? Which services are talking to one another and how does this change during failure conditions or a deploy? What helps us understand how user behavior changes over time? And which features provoked these changes?<\/p>\n<p>This talk will help prepare you to tackle these problems at a range of scales. We investigate not only existing tools, but the methods you can apply to build your own–whatever it takes to support a strong mental model of how your data is changing over time.<\/p>\n","name":"First, movement: Using time-series data to better understand our products and infrastructure","start_time":"2015-04-08T16:00:00-04:00","end_time":"2015-04-08T17:00:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Infrastructure","speaker_ids":[297],"sponsor_id":null},{"id":506,"description":"<p>The next big thing in JavaScript is ECMAScript 6 – It’s essentially a major rewrite of the Javascript engine that will change the way you develop your code. You’ll have all sorts of great features like classes, arrow notation, template strings, local block scoping, nice iterators, generators, and a lot more.<\/p>\n<p>But… the bitter pill is your browser. Not all features of ECMAScript 6 will be available now, or even in the next few years, and who knows when everyone will upgrade. But if you want to take advantage of many of these features, what are you to do?<\/p>\n<p>Enter cross-compilers. There are several popular ones, including Traceur, Google’s “transpiler”, and ‘6to5′, both of which convert ES6 to ES5. In this talk, we’ll roll up our sleeves and use JavaScript 6 features TODAY, on our browsers, writing our code with real ES 6 classes, testing with Karma, running with Gulp and NodeJS. We’ll explore the extensions that let us perform type checking of our methods. We’ll also discuss what areas of the spec to avoid, and how to write your code so it will take advantage of these features while still running well today. Let’s get ready for the future, and start reaping the benefits now.<\/p>\n","name":"Want es.next now? Traceur your way back to ES5 and feel the Harmony","start_time":"2015-04-08T13:30:00-04:00","end_time":"2015-04-08T14:30:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Languages","speaker_ids":[494],"sponsor_id":null},{"id":505,"description":"<p>For Java programmers, looping over a collection is the time-honored<br \/>\nway of processing data. Now, from Java 8 onwards, we will instead be<br \/>\nwriting stream programs – more concise, more expressive, and more<br \/>\nmaintainable. But how fast will they be? To understand the factors<br \/>\nthat control stream performance, we need to look at how streams begin<br \/>\nand end as well as the work that they do along the way. And to make<br \/>\nthings more complicated still, we have to decide when to use the<br \/>\nbuilt-in parallelization support offered by streams. In this talk<br \/>\nwe’ll disentangle these problems and create guidelines for getting the<br \/>\nbest performance from Java 8 streams.<\/p>\n","name":"Let’s Get to the Rapids: Java 8 Stream Performance","start_time":"2015-04-08T10:15:00-04:00","end_time":"2015-04-08T11:15:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Languages","speaker_ids":[343],"sponsor_id":null},{"id":498,"description":"<p>In the last decade, a class of machine learning algorithms popularly know as “deep learning” have produced state-of-the-art results on a wide variety of domains, including image recognition, speech recognition, natural language processing, genome sequencing, financial data among others.<\/p>\n<p>Facebook, Google, Twitter, NVIDIA, Apple and many other tech giants are investing heavily into deep learning, which is powered by Graphics Processing Units to accelerate computation and scale up to larger and larger deep learning models.<\/p>\n<p>What is deep learning? Why has it become so popular so quickly? How can one fit deep learning into existing pipelines?<\/p>\n","name":"The deep learning revolution: rethinking machine learning pipelines","start_time":"2015-04-07T10:15:00-04:00","end_time":"2015-04-07T11:15:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Frameworks","speaker_ids":[183],"sponsor_id":null},{"id":497,"description":"<p>Fast becoming a hot topic in the world of Reactive JVM applications is CQRS\/ES (Command Query Responsibility Segregation and Event Sourcing). These design patterns, while not new, present a fresh way to reason<br \/>\nabout application design that is a natural fit for distributed computing.<\/p>\n<p>This talk will explain the rationale behind CQRS\/ES, how it fits the Reactive paradigm and the advantages regarding both the technology and business level. We will also discuss the implications of consistency models and how this approach affects Domain Driven Design.<\/p>\n","name":"Distributed Eventsourcing with Akka","start_time":"2015-04-07T14:45:00-04:00","end_time":"2015-04-07T15:45:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Infrastructure","speaker_ids":[485],"sponsor_id":null},{"id":496,"description":"<p>This talk presents Apache Spark, Spark Streaming, Apache Kafka, Apache Cassandra and Akka as supporting Lambda architecture in the context of a fault tolerant, streaming big data pipeline. We will walk through the Fault Tolerance story with these technologies to build applications, and how to easily implement and integrate them in a Scala Akka application for real-time delivery of meaning at high velocity, in highly distributed and concurrent environments.<\/p>\n","name":"Streaming Big Data with Spark, Spark Streaming, Kafka, Cassandra and Akka","start_time":"2015-04-07T11:30:00-04:00","end_time":"2015-04-07T12:30:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Infrastructure","speaker_ids":[260],"sponsor_id":null},{"id":492,"description":"<p>Social engineers use a dangerous combination of technology and old-fashioned con artistry to infiltrate organizations every day. In this talk we’ll walk through the social engineering process including research, target selection, attack selection, and attack execution. Learn to see the world through the eyes of a social engineer and prevent your company from being a victim.<\/p>\n","name":"Social Engineering Overview: How To Prevent Your Company from Getting Hacked","start_time":"2015-04-07T14:45:00-04:00","end_time":"2015-04-07T15:45:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Management","speaker_ids":[371],"sponsor_id":null},{"id":487,"description":"<p>Developing for the web platform has historically been a slow, painful, fragile experience. You write code in multiple different languages, work with undocumented APIs, and are forced to implement things twice to have them work on both client and server. Lastly, you had better be the meticulous sort, because a single typo will bring down your site: at runtime, in production!<\/p>\n<p>Scala.js is an attempt to fix this problem. Like other compile-to-JS languages, it provides a concise, expressive language to do your work. Unlike others, it also promises seamless interop with Javascript, a ready-to-go ecosystem, tool support, and a smooth development experience. Above all, Scala.js provides Safety: an extreme level of safety that goes far beyond any competitor. Not only is your Scala.js code checked, but any use of Javascript APIs is also checked, and so are your Ajax calls between client and server!<\/p>\n<p>This talk will show off Scala.js and how you can get started using it. Starting from nothing, we will build a number of small Scala.js applications, which will hopefully demonstrate this promise. No Scala experience required.<\/p>\n","name":"Scala.js: Safety and Sanity in the Wild West of Web development","start_time":"2015-04-08T14:45:00-04:00","end_time":"2015-04-08T15:45:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Languages","speaker_ids":[302],"sponsor_id":null},{"id":484,"description":"<p>Our approach to programming for the past 50+ years has mostly focused on specific features of a programming language. The result has been an emphasis on “general purpose” programming languages. The resulting language features, like object-orientation or static typing, must then be generally applicable. Where that generality fails, we expend enormous effort attempting to work around the difficulties, rather than avoiding them.<\/p>\n<p>The next 10 million programs will not be built this way. We don’t have the time. We don’t have the money. And we can’t afford to fail as we have been. While the cost of almost everything is going down, the cost of failure is going up.<\/p>\n<p>Relatively recently, the term ‘polyglot programming’ became popular, and there was much discussion about how different parts of a system should be written in different languages.<\/p>\n<p>In this talk, I will introduce the idea of using different interoperable languages for different parts of the application life-cycle.<\/p>\n<p>I will demonstrate how the Cynefin framework supports this approach to building systems. Using the Cynefin framework involves recognizing that the world is not divided into order and disorder. There are four distinct types of order.<\/p>\n<p>I will also explain how it is possible to build reliable systems from unreliable components. I will answer the question: How do we structure our community, processes, and system architecture so that the reliability of the system as a whole is greater than the reliability of any particular piece?<\/p>\n<p>Throughout the talk, I’ll use examples from Rubinius 3.0 to illustrate the ideas I will be presenting.<\/p>\n","name":"The End Of General Purpose Languages: Rubinius 3.0 And The Next 10 Million Programs","start_time":"2015-04-08T11:30:00-04:00","end_time":"2015-04-08T12:30:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Languages","speaker_ids":[323],"sponsor_id":null},{"id":483,"description":"<p>Angular 2 is built for huge web applications that stand the test of time. To accomplish this, Angular 2 utilizes the latest and greatest web technologies like ES6 modules\/classes and Web Components. Come get a preview of what this looks like with Egghead.io instructor Kent C. Dodds as he live codes an application using the pre-release alpha version of Angular 2.<\/p>\n","name":"Angular 2: Built for Huge, Long-lasting Applications","start_time":"2015-04-08T10:15:00-04:00","end_time":"2015-04-08T11:15:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Frameworks","speaker_ids":[471],"sponsor_id":null},{"id":477,"description":"<p>Marketing for a developer focused company, tends to work pretty differently from other fields. Designing eye catching newsletters, ads and other social media of your product doesn’t fly…not even a little bit. Developers are problem solvers and operate in focused communities that let them share knowledge. We need to engage with them in these communities.<\/p>\n<p>Its not enough to just have docs, sample apps and fast support. If you want to bring developers to your product and see how to they interact with it, Evangelism is a necessary part of the equation. In this talk we will walk through key aspects of Evangelism and different strategies SendGrid has used and currently uses to reach these developers and turn them into friends who become customers.<\/p>\n<ul>\n<li>What is a Developer Evangelist?<\/li>\n<li>How to hire.<\/li>\n<li>Phases of an Evangelist team.<\/li>\n<li>Online\/Offline outreach strategy.<\/li>\n<li>Measuring Evangelism.<\/li>\n<\/ul>\n<p>Join Kunal Batra, a team lead on SendGrid’s developer relations team as he walks through the role of a Developer Evangelist and shares data and stories he’s collected from his over 2+ years of being a Evangelist at SendGrid.<\/p>\n","name":"How SendGrid scaled their Developer Evangelism outreach","start_time":"2015-04-07T16:00:00-04:00","end_time":"2015-04-07T17:00:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Management","speaker_ids":[172],"sponsor_id":null},{"id":470,"description":"<p>coming soon<\/p>\n","name":"Why the Face of Tech Remains Stubbornly Male","start_time":"2015-04-07T13:30:00-04:00","end_time":"2015-04-07T14:30:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Management","speaker_ids":[178,177],"sponsor_id":null},{"id":467,"description":"<p>We explain optimization techniques used to set three world speed records. Using a combination of code generation and hardware specific optimizations, we achieved a 20x speedup over hand tuned assembly. These techniques depend on two things 1) exploiting domain specific dependencies that are too specialized for a compiler to detect and too tedious for a programmer to exploit, and 2) knowing how to profile the operations being performed by your CPU. These optimizations can be successfully applied to CPU bound code in any compiled language for a wide range of analytics problems.<\/p>\n","name":"Beating Hand Tuned Assembly in Compiled Languages","start_time":"2015-04-08T16:00:00-04:00","end_time":"2015-04-08T17:00:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Languages","speaker_ids":[465],"sponsor_id":null},{"id":460,"description":"<p>Rarely do we have a chance to rewrite an application from scratch with the newest techniques. Generally we must work within our existing architectures evolving and refactoring years of code. This can make it seem reactive programming either can’t be introduced or doesn’t play a role.<\/p>\n<p>Netflix has been doing reactive programming with RxJava in production for several years and only recently embarked on “greenfield” development efforts that are fully async. This talk will leverage the experience of introducing reactive programming into existing imperative, blocking codebases to demonstrate how it can be done and when it can make sense to do so. Not all benefits of reactive programming can be obtained without a greenfield, fully async architecture, but many can. Subjects to be covered will include the mental shift from imperative to declarative, working with blocking IO such as JDBC and RPC, service composition, debugging and unit testing.<\/p>\n","name":"Applying Reactive Programming to Existing Applications","start_time":"2015-04-08T11:30:00-04:00","end_time":"2015-04-08T12:30:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Frameworks","speaker_ids":[270],"sponsor_id":null},{"id":459,"description":"<p>Ember is the only front-end framework that prides itself on being a complete, off-the-shelf solution for building ambitious JavaScript<br \/>\napplications. In this talk, Tom will take you on a tour of the highlights of this battle-tested framework.<\/p>\n<p>Topics covered include:<\/p>\n<p>How Ember is a truly open source project led by the community<\/p>\n<p>The exploding Ember.js addon ecosystem that makes you productive out-of-the-box<\/p>\n<p>Best-in-class tooling that helps you develop quickly, without wasting<br \/>\ntime assembling ad hoc solutions<\/p>\n<p>The sophisticated Inspector, which makes exploring and debugging your<br \/>\nEmber app a breeze with the free Chrome and Firefox extension<\/p>\n<p>Built-in support for using ES6 today, even on older browsers<\/p>\n<p>Managing complexity at scale with a proven programming model<\/p>\n<p>How Ember 2.0 learned from and improves on React’s component architecture<\/p>\n","name":"Ember: Off-the-Shelf Productivity","start_time":"2015-04-07T10:15:00-04:00","end_time":"2015-04-07T11:15:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Frameworks","speaker_ids":[263],"sponsor_id":null},{"id":458,"description":"<p>You may have seen Rust on Hacker News, Reddit or Twitter, but what is all the hype about? With Rust just recently having become stable, now’s a great time to learn more about this emerging language that is taking on old stalwarts like C++ without giving up on the expressiveness of higher level languages.<\/p>\n<p>In this talk, Yehuda will talk about Rust’s ownership system, which provides automatic memory management without paying the runtime cost of a garbage collector or reference counting. Instead, Rust guarantees, at compile time, that your program will never segfault. Learn how that can work, and how the same approach makes your Rust code remarkably resilient against memory leaks.<\/p>\n<p>Whether you’re a grizzled systems programmer or a dynamic language programmer looking to dip your toe in, this talk will have something for you.<\/p>\n","name":"What is Rust?","start_time":"2015-04-07T11:30:00-04:00","end_time":"2015-04-07T12:30:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Languages","speaker_ids":[180],"sponsor_id":null},{"id":456,"description":"<p>We are experiencing a profusion of interconnected devices. Architectures are undergoing radical changes to enable better scaling and resiliency. And at the heart of all of these are several new protocols that are changing the way services communicate. A lot of interest lies with WebSocket, HTTP\/2, CoAP, MQTT, XMPP, etc. What can these protocols do? What can we learn from them? And where are things going? This session will explore these questions and more.<\/p>\n","name":"The Changing Face of Communications: IoT, REST, & Reactive","start_time":"2015-04-07T14:45:00-04:00","end_time":"2015-04-07T15:45:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Mobile","speaker_ids":[287],"sponsor_id":null},{"id":454,"description":"<p>Netflix has a complex micro-services architecture which is run in an active-active manner from multiple geographies on top of AWS. Application deployment and management is a very important aspect of running services in this manner at scale. We have developed Titan to make cluster management, application deployments and process supervision much more robust and efficient in terms of cpu\/memory utilization across all of our servers in different geographies.<\/p>\n<p>Titan is built on top of Apache Mesos for scheduling processes of applications on top of AWS EC2. In this talk we will talk about the design of our Mesos framework and the scheduler. We will focus on the following aspects of the scheduler – Bin packing algorithms, Scaling in and out of clusters, fault tolerance of processes via reconciliation and processing life cycle events, multi-geography\/cross data center redundancy.<\/p>\n","name":"Distributed Scheduling with Apache Mesos in the Cloud","start_time":"2015-04-08T16:00:00-04:00","end_time":"2015-04-08T17:00:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Infrastructure","speaker_ids":[415],"sponsor_id":null},{"id":450,"description":"<p>When your top talent gets a call from your competitor down the street offering a 10% bump in salary, will they stay or jump? Is money everything? What can else can you offer them so that they will stay with you? There are no absolutes, but there are companies with low turn-over and the things they pay attention to tend to be quite different from what the companies that have retention issues pay attention to.<\/p>\n<p>Come learn what else you can be offering your employees.  Tom Devane (Workplace Dynamics) will lead a panel of industry experts who have figured out the secret to retaining their top talent.  The panel includes representatives from the small startup to the large enterprise.  Hear from Rick Nucci (Guru\/Dell Boomi),Mike Rappaport (Chariot Solutions), Beth Arnholdt (Comcast).<\/p>\n","name":"Creating a Workplace to Retain your Tech Talent","start_time":"2015-04-07T10:15:00-04:00","end_time":"2015-04-07T11:15:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Management","speaker_ids":[355,198,326,479],"sponsor_id":null},{"id":447,"description":"<p>React changed how we think about developing user interfaces. In this talk I’ll cover fundamental shifts in thinking presented by React and why they’re important.<\/p>\n","name":"React: not just a popular library","start_time":"2015-04-08T16:00:00-04:00","end_time":"2015-04-08T17:00:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Frameworks","speaker_ids":[446],"sponsor_id":null},{"id":444,"description":"<p>Rich Hickey has previously discussed value, identity and state – but outside the context of the specifics of how we write code on the JVM.  But how do these concepts correlate to the programming constructs we use to write code in Java and Scala, and how do we minimize or mitigate the impact of concurrency with them.<\/p>\n<p>This talk will be an accessible exploration of the JVM Heap, thread stacks and concurrency primitives on the JVM and how to compose multi-threaded code in Java and Scala.<\/p>\n","name":"The Mutability Matrix of Pain: An Accessible Exploration of the JVM Heap","start_time":"2015-04-08T11:30:00-04:00","end_time":"2015-04-08T12:30:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Infrastructure","speaker_ids":[366],"sponsor_id":null},{"id":443,"description":"<p>What happens if you take everything that is happening in your company—every click, every database change, every application log—and make it all available as a real-time stream of well structured data?<\/p>\n<p>I will discuss the experience at LinkedIn and elsewhere moving from batch-oriented ETL to real-time streams using Apache Kafka. I’ll talk about how the design and implementation of Kafka was driven by this goal of acting as a real-time platform for event data. I will cover some of the challenges of scaling Kafka to hundreds of billions of events per day at Linkedin, supporting thousands of engineers, applications, and data systems in a self-service fashion.<\/p>\n<p>I will describe how real-time streams can become the source of ETL into Hadoop or a relational data warehouse, and how real-time data can supplement the role of batch-oriented analytics in Hadoop or a traditional data warehouse.<\/p>\n<p>I will also describe how applications and stream processing systems such as Storm, Spark, or Samza can make use of these feeds for sophisticated real-time data processing as events occur.<\/p>\n","name":"Putting Apache Kafka to Use: Building a Real-time Data Platform for Event Streams","start_time":"2015-04-08T14:45:00-04:00","end_time":"2015-04-08T15:45:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Infrastructure","speaker_ids":[182],"sponsor_id":null},{"id":442,"description":"<p>Keeping a multi-faceted system running is hard work. It’s even harder when you have to deal with the day to day nonsense that happens on the web. Gathering the data you need to drive your business is also a tricky game. It is made even more complicated by all of the bots running around messing up the place. And the attacks. Oh the attacks. Every day all day with the attacks…<\/p>\n<p>It’s not enough to just run your systems. The volume of robotic traffic your system deals with on a daily basis may surprise you. This traffic distorts your numbers, steals your data, and can even cause downtime. You can’t ignore it any longer.<\/p>\n<p>Join Aaron as he explores ways to identify and deal with bad robots. He will show you what to look for, how to sort good bots from bad, and what to do with the information once you have it. It will help you deal more efficiently with scrapers, crawlers, scanners, fraudsters, and general malicious activity on your systems and gain some much needed confidence and visibility into the types of traffic you actually get on a day to day basis.<\/p>\n","name":"Rock ‘Em Sock ‘Em Robots: Bot Swatting Like the Pros","start_time":"2015-04-08T14:45:00-04:00","end_time":"2015-04-08T15:45:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Frameworks","speaker_ids":[256],"sponsor_id":null},{"id":439,"description":"<p>Performance tuning is a methodical and an iterative process. It is imperative to have a performance plan coexist with a product development plan. A performance plan not only serves to document the requirements but also feeds into designing the performance experiments and helps in providing a clear understanding of the performance infrastructural needs.<\/p>\n<p>As a JVM\/GC performance engineer – I always ask pertinent questions such as – what are performance expectations of the product by the stakeholders? what are the important metrics?, what are the tuning goals?, etc. and then I discuss tradeoffs and finally establish tuning goals.<\/p>\n<p>During this session, I will discuss these questions, tradeoffs and goals and I will also talk about my experience with three garbage collectors in OpenJDK’s HotSpot JVM – Parallel Old, CMS and G1 and compare and contrast them.<\/p>\n","name":"GC Tuning Confessions Of A Performance Engineer","start_time":"2015-04-08T14:45:00-04:00","end_time":"2015-04-08T15:45:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Languages","speaker_ids":[190],"sponsor_id":null},{"id":433,"description":"<p> <\/p>\n<p>Over the past ten years, software development teams using Agile approaches to work have adopted retrospective meetings as a critical practice for learning and continuous improvement. To the extent that practitioners say, “If you’re not holding iteration retrospectives, you’re not doing Agile.”<\/p>\n<p>Agile retrospectives at the end of each iteration or work increment set aside time for the team to examine feedback from current conditions and develop targeted tactics to keep the project on track. Many practitioners experience retrospectives as a great means for detecting good, poor, and missing practices; as a handle to make tacit knowledge about effective practices explicit; and to define improvement actions in order to deal with ineffective or inefficient technical, process, and teamwork practices.<\/p>\n<p>However, too many teams and practitioners don’t reap the benefits that effective retrospective meetings can provide. Too many retrospective meetings receive cursory or inadequate facilitation. Too many retrospective meetings are held to  “check the box” on the project management template, rather than to focus on real improvements. For too many teams, the action plans coming out of retrospectives are never implemented or revisited. Too many teams seek to shift blame and responsibility for action through the retrospective.<\/p>\n<p>In too many organizations, retrospective meetings don’t deliver the promised return on time invested (ROTI).<\/p>\n<p>In this session, you’ll learn how to get the most from your retrospective practices. Diana Larsen, co-author of <em>Agile Retrospectives: Making Good Teams Great<\/em>, will introduce you to a simple framework for getting better outcomes from retrospective meetings, suggest ways to maintain the relevance of improvement to the work of your team, and provide tips and pointers to get great returns from the time your teams devote to every meeting.<\/p>\n","name":"Improving and Extending Retrospective Outcomes","start_time":"2015-04-07T16:00:00-04:00","end_time":"2015-04-07T17:00:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Agile","speaker_ids":[411],"sponsor_id":null},{"id":428,"description":"<p>The goal of core.async is to decouple producers and consumers of information in software, without dictating specific thread or blocking semantics, and without introducing callback hell. Also, to do all of this as a library, portable anywhere you can run a dialect of Clojure.<\/p>\n<p>Queues are a powerful tool for decoupling software programs. Unfortunately, platforms that have powerful queueing libraries (e.g. Java) may require blocking threads on the ends of the queue. And the world’s biggest platform (JavaScript in the browser) doesn’t even have queues or threads.<\/p>\n<p>core.async builds upon the work done with <a href=\"http:\/\/en.wikipedia.org\/wiki\/Communicating_sequential_processes\">Communicating Sequential Processes<\/a>, and provides:<\/p>\n<ul>\n<li>facilities for independent threads of activity, communicating via queue-like <em>channels<\/em><\/li>\n<li>both real threads and shared use of thread pools (in any combination), as well as ClojureScript on JS engines<\/li>\n<\/ul>\n<p><strong>What We Will Cover<\/strong><\/p>\n<p>In this talk, we will cover the design of core.async, and then move directly to exploring core.async’s capabilities:<\/p>\n<ul class=\"task-list\">\n<li>Creating unbuffered and buffered channels<\/li>\n<li>Threaded put <code>>!!<\/code> and take <code><!!<\/code><\/li>\n<li>Using <code>go<\/code> blocks to invert control, achieving async without threads<\/li>\n<li>IOC put <code>>!<\/code> and take <code><!<\/code><\/li>\n<li>Simultaneously waiting for multiple operations with <code>alts!<\/code> and <code>alts!!<\/code><\/li>\n<li>Timeouts as “just another kind of channel”<\/li>\n<\/ul>\n<p>Finally, we will assemble these primitives into substantial working programs, building toward the Holy Grail of async: substantial UI application development in the browser, with no callbacks in sight.<\/p>\n<p><strong><a id=\"user-content-resources\" class=\"anchor\" href=\"https:\/\/github.com\/stuarthalloway\/presentations\/wiki\/Core-Async#resources\"><\/a>Resources<\/strong><\/p>\n<ul>\n<li><a href=\"http:\/\/clojure.com\/blog\/2013\/06\/28\/clojure-core-async-channels.html\">core.async Announcement<\/a><\/li>\n<li><a href=\"http:\/\/thinkrelevance.com\/blog\/2013\/07\/10\/rich-hickey-and-core-async-podcast-episode-035\">Relevance Podcast<\/a> with Rich Hickey discussing core.async<\/li>\n<\/ul>\n","name":"core.async: Concurrency without Callbacks","start_time":"2015-04-07T11:30:00-04:00","end_time":"2015-04-07T12:30:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Languages","speaker_ids":[315],"sponsor_id":null},{"id":427,"description":"<p>Datalog is a deductive query system combining a database of facts with a set of rules for deriving new facts from existing facts and other rules. Datalog has been a signature feature of <a href=\"http:\/\/www.datomic.com\/\">Datomic<\/a> since day one, and the 2015 releases of Datomic add additional expressiveness for hierarchical selection, disjunction, and negation. In this talk, we will cover the basics of Datomic Datalog, and then dive into the latest enhancements, both in the core language and in how Datalog fits into application code.<\/p>\n<p>Datalog queries have the expressive power of SQL + recursion, and so are a good fit for systems that want “the power of SQL” but more flexibility. Perhaps more importantly, Datomic’s universal entity\/attribute\/value (EAV) schema has a one-to-one mapping with the object\/method\/argument shape of many programming languages. This allows a frictionless mapping from Datalog to application code, versus e.g. the impedance mismatch of object-relational mapping (ORM).<\/p>\n<p>In this talk you will learn the basics of <a href=\"http:\/\/docs.datomic.com\/query.html\">Datomic Datalog<\/a>:<\/p>\n<ul>\n<li>the basics of data patterns<\/li>\n<li>joining implicitly, with ever saying “join”<\/li>\n<li>extending datalog with functions and predicates<\/li>\n<li>creating reusable abstractions with datalog rules<\/li>\n<li>querying points in time, or across time<\/li>\n<\/ul>\n<p>as well as some more recent enhancements:<\/p>\n<ul>\n<li><a href=\"http:\/\/docs.datomic.com\/pull.html\">pulling<\/a> hierarchical and nested information<\/li>\n<li><a href=\"http:\/\/blog.datomic.com\/2015\/01\/datalog-enhancements.html\">negation and disjunction<\/a><\/li>\n<\/ul>\n","name":"Enhancing Datalog for Datomic","start_time":"2015-04-07T13:30:00-04:00","end_time":"2015-04-07T14:30:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Languages","speaker_ids":[315],"sponsor_id":null},{"id":426,"description":"<p>Diversity in IT is not only good to create better teams, it is actually an economic necessity for companies. The Labor Department predicts there will be 1 million new, unfilled jobs in the tech industry by 2020.<\/p>\n<p>With women and minorities making up a small percentage of the IT workforce and their numbers increasing in the general workforce, it makes sense to attract these groups to our field. But,we have not been successful in the past 40 years in creating this pipeline of candidates through traditional methods so what do we need to do differently.<\/p>\n<p>Join our panelists who are part of a growing movement of non-profits working to change the discussion among women and minorities to learn more about their programs, what lessons they are learning about working with these groups, how they are helping to teach organizations to create diverse talent and potentially, how you can help solve this issue.<\/p>\n","name":"New Pipelines for Diverse IT Talent","start_time":"2015-04-07T11:30:00-04:00","end_time":"2015-04-07T12:30:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Management","speaker_ids":[147,273,285,176],"sponsor_id":null},{"id":419,"description":"<p>Linux containers provide the ability to reliably deploy 1000s of application instances in seconds, but how do we manage it all? The answer is CoreOS and Kubernetes. This talk will help attendees wrap their minds around complex topics such as distributed configuration management, service discovery, and application scheduling at scale.<\/p>\n","name":"Managing Containers at Scale with CoreOS and Kubernetes","start_time":"2015-04-08T10:15:00-04:00","end_time":"2015-04-08T11:15:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Infrastructure","speaker_ids":[282],"sponsor_id":null},{"id":418,"description":"<p>Today’s applications are distributed systems – they’ve outgrown single servers, and “scale-out” architectures have become the norm. But building new distributed systems, especially those that need to explicitly manage data, is still brittle and difficult, especially in failure and maintenance scenarios.<\/p>\n<p>In this talk, Benjamin Hindman (one of the original creators of the Apache Mesos project) will discuss Apache Mesos and how it can be used to more easily build and run distributed systems. In particular, he’ll focus on the Mesos API for building a distributed system, and discuss how the primitives provided by Mesos can make it easier to build new stateful services and frameworks such as key value stores, message queues, message brokers, and distributed file systems.<\/p>\n","name":"Building Distributed Systems with Apache Mesos","start_time":"2015-04-08T13:30:00-04:00","end_time":"2015-04-08T14:30:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Infrastructure","speaker_ids":[271],"sponsor_id":null},{"id":410,"description":"<p>Go is a natural fit for building web applications and services. Over the last few years the Go community has been busy creating better tools for web development in Go. Because of this surge in web frameworks, many questions have come to light:<\/p>\n<ul>\n<li>Which web framework should I use?<\/li>\n<li>Should I even use a framework?<\/li>\n<li>What the heck is a framework?<\/li>\n<\/ul>\n<p>In this talk I will attempt to answer these questions by reflection on one of my own projects, Martini, and how my open source contributions changed from building frameworks to building smaller, more idiomatic libraries.<\/p>\n","name":"The Rise and Fall of the Go Web Framework","start_time":"2015-04-07T13:30:00-04:00","end_time":"2015-04-07T14:30:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Frameworks","speaker_ids":[324],"sponsor_id":null},{"id":409,"description":"<p>We’ve entered the Ambient Computing Era and JavaScript is its dominant programing language, But a new computing era needs a new and better JavaScript. It’s called ECMAScript 6 and it’s about to become the new JavaScript standard. Why do we need it? Why did it take so long? What’s in it? When can you use it? What comes next? Answers will be given.<\/p>\n","name":"ECMAScript 6: A Better JavaScript for the Ambient Computing Era","start_time":"2015-04-07T16:00:00-04:00","end_time":"2015-04-07T17:00:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Languages","speaker_ids":[142],"sponsor_id":null},{"id":407,"description":"<p>Modern, cloud-native applications typically use a microservices architecture in conjunction with NoSQL and\/or sharded relational databases. However, in order to successfully use this approach you need to solve some distributed data management problems including how to maintain consistency between multiple databases without using 2PC. In this talk you will learn more about these issues and how to solve them by using an event-driven architecture. We will describe how event sourcing and Command Query Responsibility Separation (CQRS) are a great way to realize an event-driven architecture. You will learn about a simple yet powerful approach for building, modern, scalable applications.<\/p>\n","name":"Developing event-driven microservices with event sourcing and CQRS","start_time":"2015-04-08T13:30:00-04:00","end_time":"2015-04-08T14:30:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Frameworks","speaker_ids":[290],"sponsor_id":null},{"id":406,"description":"<p>We’ve all seen them on the corner of our local software development neighborhoods: FP purists, shamelessly peddling scalaz to unsuspecting developers. Lured in by promises of Free Monoids, Semigroups, and Endofunctors these developers soon seem lost in throes of ecstatic coding.<\/p>\n<p>To the skeptical and stubbornly practical among us, the above might ring a little true – especially if read in Rod Serling’s voice. Images of gibbering horrors lurking in the depths of mathematical perfection swim before our eyes.<\/p>\n<p>But what if there is true value in the world of scalaz? What if it is possible to use these tools for good (and a little bit of evil – it’s fun to use learning for evil!) and profit… Without getting hopelessly lost in the opium dens of FP?<\/p>\n<p>In this talk we will look at some of the “gateway drugs” of scalaz: Validation, NonEmptyList, \\\/, Monad Transformers, and more. How do they work from a practical standpoint? What is their value for real world applications? Can we use them without an advanced Maths PhD? And just how fun is it to *really* code with these tools?<\/p>\n","name":"A Skeptic’s Look at scalaz’ “Gateway Drugs”: A Practical Exploration","start_time":"2015-04-08T11:30:00-04:00","end_time":"2015-04-08T12:30:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Languages","speaker_ids":[338],"sponsor_id":null},{"id":405,"description":"<p>ReactiveCocoa is an elegant framework that radically changes the way we structure our applications and handle flows of data. However, it’s beauty is somewhat marred by Objective-C! In this talk I will cover the basics of ReactiveCocoa and the principles of Functional Reactive Programming. Through simple practical examples I will show how ReactiveCocoa and Swift form a beautiful partnership.<\/p>\n","name":"Swift, ReactiveCocoa … Better Together","start_time":"2015-04-07T16:00:00-04:00","end_time":"2015-04-07T17:00:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Mobile","speaker_ids":[258],"sponsor_id":null},{"id":397,"description":"<p>Last year, Miles Sabin wrote that “there is … a significant constituency at the core of the Scala community whose needs are not being fully met [by Typesafe’s focus on stability and Java 8 compatibility].” That statement summarizes the mission behind <a href=\"http:\/\/Typelevel.org\">Typelevel.org<\/a>, a project that currently consists of a fork of the Scala compiler, as well as various well-known Scala open source libraries.<\/p>\n<p>Is this a positive and natural outgrowth of a growing and vibrant language or will this development cause irreparable rifts in the Scala community? Is this a bad thing or a good thing?<\/p>\n<p>These are the issues we’ll explore during this panel. Jamie Allen, Typesafe Senior Director of Global Services, will be representing the Typesafe position. Erik Osheim, co-creator of the Typelevel project Spire, will be representing the Typelevel position. Brendan McAdams and Michael Pilquist both have Considerable experience with Typesafe and Typelevel technologies and will round out the discussion. Brian Clapper will be moderating the discussion.<\/p>\n<p>We’ll discuss the issues, explore the possibilities, and field your questions. Join us.<\/p>\n","name":"Typesafe Scala, Typelevel Scala – What’s Going On, Anyway?","start_time":"2015-04-08T10:15:00-04:00","end_time":"2015-04-08T11:15:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Languages","speaker_ids":[366,346,338,361,413],"sponsor_id":null},{"id":395,"description":"<p>Complex software always has an architecture, even if it isn’t intentional. But being agile isn’t enough to enough guarantee a sustainable architecture. It isn’t prudent to just keep your code clean and hope that good architecture will just emerge. Especially when there is a lot of technical risk, interdependencies, and conflicting priorities. Good architecture requires ongoing attention and stewardship. This talk presents several techniques and architectural activities that are useful on agile projects and explains how an agile architect’s role can and should differ from that of a traditional<br \/>\nsoftware architect.<\/p>\n","name":"Why We Need Architects (and Architecture) on Agile Projects","start_time":"2015-04-08T16:00:00-04:00","end_time":"2015-04-08T17:00:00-04:00","duration":3600,"session_location_name":"Salon D","session_track_name":"Agile","speaker_ids":[262],"sponsor_id":null},{"id":394,"description":"<p>Writing multithreaded code is<i> hard<\/i>—even harder than most people realise.<\/p>\n<p>The good news is that there are other approaches, such as Functional Programming, Communicating Sequential Processes, Actors, and so on, which make it <i>much<\/i> easier.<\/p>\n<p>This talk will start by looking at some of the less well-understood problems with multi-threaded programming—everyone knows about deadlock and livelock, but do you know what the memory model says about concurrent code, and why that makes it even harder to write than you thought?<\/p>\n<p>We’ll then move on to look at the alternatives, and see why they avoid these problems. We’ll concentrate on Actors, and see how they not only solve the problems with Threads and Locks, but also make your code clearer and more robust.<\/p>\n","name":"Concurrency: It’s Harder (and Easier) Than You Think","start_time":"2015-04-07T13:30:00-04:00","end_time":"2015-04-07T14:30:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Languages","speaker_ids":[362],"sponsor_id":null},{"id":393,"description":"<p>Based on the ideas in Ron’s new book <a href=\"https:\/\/pragprog.com\/book\/rjnsd\/the-nature-of-software-development\">The Nature of Software Development<\/a>, Ron and Chet will talk about the current state of “Agile Software Development”, discussing the extent to which Agile’s good ideas have been watered down, and with special attention to the current interest in “scaling” Agile.<\/p>\n","name":"The Nature of Software Development","start_time":"2015-04-08T13:30:00-04:00","end_time":"2015-04-08T14:30:00-04:00","duration":3600,"session_location_name":"Salon C","session_track_name":"Agile","speaker_ids":[238,240],"sponsor_id":null},{"id":379,"description":"<p>Massively concurrent systems are the future, and shared data mutability is the obstacle to getting there. Where does that leave imperative languages like Java, that depend on mutation? Java 8 squares the circle with the Collectors API, which manages concurrent access to non-threadsafe mutable collections, giving the developer parallelism “for free”. Sometimes you need to change the way you think about a problem, but often all you need to do is follow a few simple rules, and your code too can be Parallel-Ready.<\/p>\n","name":"Parallel-Ready Java Code: Managing Mutation in an Imperative Language","start_time":"2015-04-07T14:45:00-04:00","end_time":"2015-04-07T15:45:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Languages","speaker_ids":[343],"sponsor_id":null},{"id":365,"description":"<p>Languages like Scala are making it easier to implement systems with distributed domains and distributed computation. Deployment, monitoring and operation of such systems is often neglected, left to the last moment. Jan will show how architect and implement your system with DevOps in mind right from the start.<\/p>\n<p>You will see the details of a cluster-sharded domain in an Akka cluster, and a distributed computation in Spark, with REST APIs and mobile and wearable clients, running in a large number of Docker containers, with management from Marathon.<\/p>\n<p>Come to Jan’s talk to find out about the challenges of designing and running such systems; you do not need to be an expert, or even have heard about the technologies Jan will show, to walk away with an appreciation of designing and running distributed systems.<\/p>\n","name":"Implementing Exercise Wearables Analysis with Spark and Akka","start_time":"2015-04-07T13:30:00-04:00","end_time":"2015-04-07T14:30:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Infrastructure","speaker_ids":[354],"sponsor_id":null},{"id":364,"description":"<p>You’re ready to go with all the best Agile practices: you’ll develop incrementally and iteratively, you’ll have sprints and retrospectives, and you can’t wait to tell your clients about your velocity and show them your burndown charts. But all of your prospective clients are telling you they want firm quotes, and contracts with detailed specifications and delivery dates. Clients almost always start with a preference for these types of traditional contracts. Such contracts provide them with a sense of security and confidence that they will get what they want.<!--more--><\/p>\n<p>How do you convince them a traditional contract is actually riskier than they think, and persuade them to instead sign an Agile (time and materials) contract? This is the most significant challenge facing consultants who want to follow Agile practices. In this talk we’ll discuss:<\/p>\n<p>* The specifics of the language in a contract that distinguishes an Agile contract from a traditional contract. This includes important clauses to protect both the consultant and the client.<\/p>\n<p>* The persuasion and negotiation process for getting your prospective client to sign an Agile contract. We’ll discuss real-life situations from our experience at PromptWorks.<\/p>\n<p>* Signing the contract is just the first step – you and your client must then work together to deliver a successful project. We’ll discuss what do if things go wrong, to get a struggling Agile consulting project back on track and avoid costly legal difficulties.<\/p>\n","name":"Agile Contracts for Software Consultants","start_time":"2015-04-08T10:15:00-04:00","end_time":"2015-04-08T11:15:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Agile","speaker_ids":[363],"sponsor_id":null},{"id":350,"description":"<p>Organizations will never realize the full potential of emerging technologies until they change their culture to one that learns fast through experimentation. To do this, many long held management beliefs and practices must be retired and replaced by approaches that allow knowledge workers to deliver better outcomes for all users of technology. In this session, Joanne will present principles, stories and practical suggestions on how to build a successful organizational culture that supports experimentation and learning with the goal to delivering better value for customers.<\/p>\n","name":"Getting More from Technology","start_time":"2015-04-08T11:30:00-04:00","end_time":"2015-04-08T12:30:00-04:00","duration":3600,"session_location_name":"Salon E","session_track_name":"Agile","speaker_ids":[348],"sponsor_id":null},{"id":342,"description":"<p>In this talk, Ash Furrow, author and iOS engineer at Artsy, presents the current state of Apple’s new programming language: Swift. He’ll begin with a description of why Swift was needed – what problems existed with Objective-C and how does Swift address them? Speaking from experience of developing a production application using Swift, Ash will discuss Swift’s readiness from both technical and business standpoints.<\/p>\n","name":"Catching up with Swift","start_time":"2015-04-08T13:30:00-04:00","end_time":"2015-04-08T14:30:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Mobile","speaker_ids":[340],"sponsor_id":null},{"id":253,"description":"<p>Mobile app development is a growing field with plenty of promise. It used to be that hybrid mobile apps weren’t ready for prime time — they were slow and unattractive. Then, along came AngularJS, which changed the way developers built apps for the web. Ionic, built on top of AngularJS, has dramatically changed the way developers build mobile apps. It’s open source, easy to use, beautiful, and ready to perform. In this talk, learn more about Ionic and its components, build a sample app, and explore the suite of tools and services Ionic provides for hybrid mobile app development.<\/p>\n","name":"Introduction to Ionic – a Cordova and AngularJS-based mobile Web App framework","start_time":"2015-04-08T14:45:00-04:00","end_time":"2015-04-08T15:45:00-04:00","duration":3600,"session_location_name":"Salon A","session_track_name":"Mobile","speaker_ids":[249],"sponsor_id":null},{"id":234,"description":"<p><b>Move Fast, Break Nothing<\/b><\/p>\n<p>Today we are plagued by hundreds of choices when architecting a modern data center. Should our machines be virtual or physical? Should we use containers or Docker? Should we use a public cloud provider or a private cloud provider? Which configuration management tool is best to use? What about IaaS, PaaS, and SaaS? It would be manageable if these were binary choices; however, we often find ourselves in a hybrid environment.<\/p>\n<p>As more operations choices are added to your data center, whether through company acquisitions, a growing development team, or general technical debt, managing complexity between legacy and new systems becomes a nightmare. Yet the end goal is still the same — safely deploy your application to your infrastructure. We need to tame our data centers by managing change across systems, enforcing policies, and by establishing a workflow for both developers and operations engineers to build in a collaborative environment.<\/p>\n<p>This talk will discuss the problems faced in the modern data center, and how a set of innovative open source tooling can be used to tame the rising complexity curve. Join me on an adventure with Vagrant, Consul, and Terraform as we take your data center from chaos to control.<\/p>\n","name":"Taming the Modern Data Center","start_time":"2015-04-07T16:00:00-04:00","end_time":"2015-04-07T17:00:00-04:00","duration":3600,"session_location_name":"Salon B","session_track_name":"Infrastructure","speaker_ids":[232],"sponsor_id":null}],"sponsors":[{"id":566,"description":"<p>Streetcar Cinema is your all-in-one film and video production solution that will help you take any idea and turn it into a bold and engaging video.  We provide services like producing and directing, video\/audio recording and editing, concept-development and script-writing, and more.<\/p>\n","name":"Streetcar Cinema","sponsor_type_name":"Media","url":"http:\/\/www.streetcarcinema.com","sponsor_display_order":10,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/03\/logo-streetcar-cinema.png"},{"id":556,"description":"<p>Typesafe is the proud provider of the world’s leading Reactive application development platform. We are a passionate crew of technology pioneers committed to building amazing software. We build and maintain the <a href=\"https:\/\/typesafe.com\/community\/core-projects\/play-framework\">Play web framework<\/a>, the <a href=\"https:\/\/typesafe.com\/community\/core-projects\/akka\">Akka message driven runtime<\/a>, and the <a href=\"https:\/\/typesafe.com\/community\/core-projects\/scala\">Scala programming language<\/a>. Our mission is to help developers build high-performance applications that are responsive, resilient, elastic, and message driven.<\/p>\n","name":"Typesafe","sponsor_type_name":"Friend","url":"https:\/\/www.typesafe.com","sponsor_display_order":9,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/03\/logo-typesafe-300.png"},{"id":530,"description":"<p>Hortonworks<sup>®<\/sup> (NASDAQ: HDP) is the leading contributor to and provider of Apache™ Hadoop<sup>®<\/sup> for the enterprise, and our mission is to establish Hadoop as the foundational technology of the modern enterprise data architecture. Our solution, the <a title=\"Hortonworks Data Platform\" href=\"http:\/\/hortonworks.com\/hdp\/\">Hortonworks Data Platform<\/a> (HDP), is an enterprise-grade data management platform that enables a centralized architecture for running batch, interactive and real-time applications simultaneously across a shared dataset. HDP is built on <a title=\"Apache Hadoop\" href=\"http:\/\/hortonworks.com\/hadoop\">Apache Hadoop<\/a>, powered by <a title=\"Power by Yarn\" href=\"http:\/\/hortonworks.com\/yarn\">YARN<\/a>, and supported by a comprehensive set of capabilities that address the core requirements of security, operations and data governance.<\/p>\n","name":"Hortonworks","sponsor_type_name":"Headline","url":"http:\/\/www.hortonworks.com","sponsor_display_order":1,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/03\/logo-hortonworks-300.png"},{"id":474,"description":"<p>We are the largest online video distributor of international televised content streaming the world’s best movies, documentaries and TV shows on demand with professional subtitles.<\/p>\n","name":"DramaFever","sponsor_type_name":"Lunch","url":"http:\/\/www.dramafever.com","sponsor_display_order":4,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/logo-dramafever-300.png"},{"id":461,"description":"<p>DIRECTV is one of the world’s leading providers of digital television entertainment services delivering a premium video experience through state-of-the-art technology, unmatched programming, and industry leading customer service to more than 37 million customers in the U.S. and Latin America.<\/p>\n","name":"DIRECTV","sponsor_type_name":"Breakfast","url":"http:\/\/www.directv.com","sponsor_display_order":3,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/02\/logo-directtv-300.png"},{"id":424,"description":"<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together.<\/p>\n<p>With the <a href=\"https:\/\/github.com\/features\/\">collaborative features of GitHub.com<\/a>, our <a href=\"http:\/\/mac.github.com\/\">desktop apps<\/a>, and <a href=\"https:\/\/enterprise.github.com\/\">GitHub Enterprise<\/a>, it has never been easier for individuals and teams to write better code, faster.<\/p>\n","name":"GitHub","sponsor_type_name":"Lanyard","url":"https:\/\/github.com","sponsor_display_order":6,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/logo-github-300.png"},{"id":422,"description":"<p>At Cerner, we’re continuously building on our foundation of intelligent solutions for the health care industry. Our technologies connect people and systems at more than 14,000 facilities worldwide, and our wide range of services support the clinical, financial and operational needs of organizations of every size.<\/p>\n","name":"Cerner","sponsor_type_name":"Video","url":"http:\/\/www.cerner.com","sponsor_display_order":2,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/logo-cerner-300.png"},{"id":400,"description":"<div>\n<p>We make handcrafted software for remarkable companies using Ruby, Javascript, Python, and related technologies.<\/p>\n<\/div>\n<div>\n<p>We are industry veterans with unmatched technical chops and a serious commitment to Agile practices. In addition to helping businesses build new web apps, mobile web apps, and APIs, we solve problems with existing apps like scaling, testing and automating development operations.<\/p>\n<\/div>\n<div><\/div>\n","name":"PromptWorks","sponsor_type_name":"Coffee","url":"http:\/\/www.promptworks.com","sponsor_display_order":7,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/logo-promptworks-300.png"},{"id":384,"description":"<p>Imagine thousands of engineers all over the country collaborating to develop the next generation of ideas and testing revolutionary technology — the kind of technology that results in groundbreaking new products and improved user experiences, like On Demand or the Xfinity TV app. That is a day in the life at Comcast Labs.<\/p>\n<p>The advanced technology arm of the company, Comcast Labs is focused on developing, integrating and deploying products that change how people are entertained and informed.<\/p>\n","name":"Comcast Labs","sponsor_type_name":"Pre-Party","url":"http:\/\/corporate.comcast.com\/news-information\/news-feed\/reimagining-the-future-of-technology-in-the-home","sponsor_display_order":8,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/logo-comcast-3001.png"},{"id":351,"description":"<p>eMoney aggregates more than $1.4 trillion dollars in assets for more than 25,000 financial professionals across three countries and in all fifty states, serving a million end-clients. In a manner unparalleled by any other system, eMoney has helped advisors increase assets under management, identify product opportunities, and win their clients’ confidence and loyalty.<\/p>\n","name":"eMoney Advisor","sponsor_type_name":"Breakfast","url":"http:\/\/www.emoneyadvisor.com","sponsor_display_order":3,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2015\/01\/logo-emoney-3001.png"},{"id":254,"description":"<p>SIG is a global <a href=\"http:\/\/www.sig.com\/\">quantitative trading firm<\/a>. Our 700+ technologists manage a highly complex technical environment, and we’re always looking for new minds to join our team. Our <a href=\"http:\/\/www.sig.com\/technology\/\">technology<\/a> teams work side by side with our traders and quants to build some of the highest performing systems in in the world. We’re continuously searching for the optimal solution and exploring emerging technologies that help us evolve a stable, scalable, optimized platform for our trading business.<\/p>\n<p> <\/p>\n","name":"Susquehanna International Group","sponsor_type_name":"Happy Hour","url":"http:\/\/www.sig.com","sponsor_display_order":5,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/logo-sig-300.png"},{"id":243,"description":"<p>ArdenTex, Inc., is a consulting company specializing in software development.<\/p>\n","name":"ArdenTex, Inc.","sponsor_type_name":"Friend","url":"http:\/\/www.ardentex.com","sponsor_display_order":9,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/12\/logo-ardentex-300.png"},{"id":230,"description":"<p>TriNet provides HR solutions to small to mid-sized businesses so you can focus on what your company does best. Our  <a href=\"http:\/\/www.trinet.com\/products\/default.htm\">bundled HR products<\/a>, <a href=\"http:\/\/www.trinet.com\/products\/software\/default.htm\">TriNet Cloud <\/a>applications and <a href=\"http:\/\/www.trinet.com\/services\/strategic\/default.htm\">strategic services <\/a>simplify your HR. Tailored by industry, TriNet’s bundled HR products cover the <a href=\"http:\/\/www.trinet.com\/services\/core\/default.htm\">core services<\/a> of payroll, benefits, risk & compliance, an HR team and a cloud platform. TriNet partners with more than 10,000 clients in a variety of industries (as of 09\/30\/14). We managed more than $17 billion in payroll and payroll taxes in 2013.<\/p>\n","name":"TriNet","sponsor_type_name":"Friend","url":"http:\/\/www.trinet.com","sponsor_display_order":9,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/11\/logo-trinet-300.png"},{"id":129,"description":"<p>Chariot Solutions is a software development consulting firm. We build and integrate the critical software applications that run our clients’ businesses. We are successful because we attract the most talented and collaborative software architects in the region. They are leaders in Java, open source and emerging technologies. We work in small, agile teams. We solve hard problems with a practical approach centered on communication, common sense and continual learning. We believe it is important to give back to our community through shared learning.<\/p>\n","name":"Chariot Solutions","sponsor_type_name":"Headline","url":"http:\/\/www.chariotsolutions.com","sponsor_display_order":1,"logo_url":"http:\/\/phillyemergingtech.com\/wp-content\/uploads\/2014\/10\/logo-chariot-300.png"}],"events":[{"id":559,"description":"","name":"Happy Hour","start_time":"2015-04-07T17:30:00-04:00","end_time":"2015-04-07T19:30:00-04:00","duration":7200,"session_location_name":"Hamilton Room","sponsor_id":254}]}
